[{"text": "#325 how many 6-2/6-3 freshmen actually get fancy tech internships? i always hear upperclassmen say that it's rare to intern after freshman year (most do urops or take the semester off), but it seems like more than half of other 6-2/6-3's i know (who told about their summer plans) are doing an internship i can't even dream about doing until junior year.\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#325 How many 6-2/6-3 freshmen actually get fancy tech internships? I always hear upperclassmen say that it's rare to intern after freshman year (most do UROPs or take the semester off), but it seems like more than half of other 6-2/6-3's I know (who told about their summer plans) are doing an internship I can't even dream about doing until junior year.\n", "src": "mit-summer", "id": 325, "nr-text": "how many 6-2/6-3 freshmen actually get fancy tech internships? i always hear upperclassmen say that it's rare to intern after freshman year (most do urops or take the semester off), but it seems like more than half of other 6-2/6-3's i know (who told about their summer plans) are doing an internship i can't even dream about doing until junior year.\n"}, {"text": "#320 i'm working in the bay area this summer in a not course 6 role and i'm so intimidated by how all the other mit people here seem to know each other and hang out all the time. i have a couple of friends in the area but nothing like that, and i feel kind of lonely as a result.\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#320 I'm working in the bay area this summer in a not course 6 role and I'm so intimidated by how all the other MIT people here seem to know each other and hang out all the time. I have a couple of friends in the area but nothing like that, and I feel kind of lonely as a result.\n", "src": "mit-summer", "id": 320, "nr-text": "i'm working in the bay area this summer in a not course 6 role and i'm so intimidated by how all the other mit people here seem to know each other and hang out all the time. i have a couple of friends in the area but nothing like that, and i feel kind of lonely as a result.\n"}, {"text": "#323 i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. ...\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#323 I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. I AM NOT IN SPAIN. ...\n", "src": "mit-summer", "id": 323, "nr-text": "i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. i am not in spain. ...\n"}, {"text": "#322 some of y'all are legit dumbasses that sound like a fuckin bot, do you not see how hyprocritical and privileged af it is to constantly see all these complaints about individuals gaining weight and u trya and say some shit about how it is objectively privileged garbage and then they attack you for starving saying i can do something about it much more readily than some person who even if they feel hungry just needs to eat less, there is literally an action that requires 0 money or time, two things i'd love more of. i'm pointing out how fucked you all are and you're just making it easier with your garbage arguments. what i'm trying to say is unless you all are comfortable with people talking about starving without attacking them u shouldn't say a damn word to defend these people baraginy confessions with \"im gaining weight poor me\". nobody says shit to them but ppl attack someone starving. the narrative is set to attack poor\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#322 Some of y'all are legit dumbasses that sound like a fuckin bot, do you not see how hyprocritical and privileged af it is to constantly see all these complaints about individuals gaining weight and u trya and say some shit about how it is objectively privileged garbage and then they attack you for starving saying I can do something about it much more readily than some person who even if they feel hungry just needs to eat less, there is literally an action that requires 0 money or time, two things I'd love more of. I'm pointing out how fucked you all are and you're just making it easier with your garbage arguments. What I'm trying to say is unless you all are comfortable with people talking about starving without attacking them u shouldn't say a damn word to defend these people baraginy confessions with \"Im gaining weight poor me\". Nobody says shit to them but ppl attack someone starving. The narrative is set to attack poor\n", "src": "mit-summer", "id": 322, "nr-text": "some of y'all are legit dumbasses that sound like a fuckin bot, do you not see how hyprocritical and privileged af it is to constantly see all these complaints about individuals gaining weight and u trya and say some shit about how it is objectively privileged garbage and then they attack you for starving saying i can do something about it much more readily than some person who even if they feel hungry just needs to eat less, there is literally an action that requires 0 money or time, two things i'd love more of. i'm pointing out how fucked you all are and you're just making it easier with your garbage arguments. what i'm trying to say is unless you all are comfortable with people talking about starving without attacking them u shouldn't say a damn word to defend these people baraginy confessions with \"im gaining weight poor me\". nobody says shit to them but ppl attack someone starving. the narrative is set to attack poor\n"}, {"text": "#319 help how do i stop screwing up everything i do\nit's like i can't do anything well anymore\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#319 help how do I stop screwing up everything I do\nIt's like I can't do anything well anymore\n", "src": "mit-summer", "id": 319, "nr-text": "help how do i stop screwing up everything i do\nit's like i can't do anything well anymore\n"}, {"text": "#321 funny how these commenters come to \"defend\" the people i constantly have to hear bitch and moan about them gaining weight. but their defense comes in the form of \"oh you're hungry? get a job!\" that's the most right wing gd argument in the world. i don't repsect you all as sentient people if all you can do is regurgitate shit\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#321 Funny how these commenters come to \"defend\" the people I constantly have to hear bitch and moan about them gaining weight. But their defense comes in the form of \"oh you're hungry? Get a job!\" That's the most right wing GD argument in the world. I don't repsect you all as sentient people if all you can do is regurgitate shit\n", "src": "mit-summer", "id": 321, "nr-text": "funny how these commenters come to \"defend\" the people i constantly have to hear bitch and moan about them gaining weight. but their defense comes in the form of \"oh you're hungry? get a job!\" that's the most right wing gd argument in the world. i don't repsect you all as sentient people if all you can do is regurgitate shit\n"}, {"text": "#318 really dont get what the big deal is about people complaining that their problems are so much worse than other peoples. like god damn its not a competition to find whose family is the poorest or who had the least to eat growing up or whatever. its one thing to complain, and its another to be a competitive victim trying to see who should feel the most sorry for themselves. hate to break it to you, but if you go to this school your life is better than the vast majority of people on the planet. everyone has issues, life isnt fair, and theres no point comparing your problems to others. that is all.\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#318 Really don’t get what the big deal is about people complaining that their problems are so much worse than other people’s. Like god damn it’s not a competition to find whose family is the poorest or who had the least to eat growing up or whatever. It’s one thing to complain, and it’s another to be a competitive victim trying to see who should feel the most sorry for themselves. Hate to break it to you, but if you go to this school your life is better than the vast majority of people on the planet. Everyone has issues, life isn’t fair, and there’s no point comparing your problems to others. That is all.\n", "src": "mit-summer", "id": 318, "nr-text": "really dont get what the big deal is about people complaining that their problems are so much worse than other peoples. like god damn its not a competition to find whose family is the poorest or who had the least to eat growing up or whatever. its one thing to complain, and its another to be a competitive victim trying to see who should feel the most sorry for themselves. hate to break it to you, but if you go to this school your life is better than the vast majority of people on the planet. everyone has issues, life isnt fair, and theres no point comparing your problems to others. that is all.\n"}, {"text": "#324 fuck u shitty mit wifi. i expect so much more from the best tech school in the world.\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#324 Fuck u shitty mit wifi. I expect so much more from the best tech school in the world.\n", "src": "mit-summer", "id": 324, "nr-text": "fuck u shitty mit wifi. i expect so much more from the best tech school in the world.\n"}, {"text": "#326 when is it too late to recover from a bad start professionally? my resume is essentially empty, doing a urop over the summer but i doubt i'll get much done, no extracurriculars and shit, no awards ever since high school\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#326 when is it too late to recover from a bad start professionally? my resume is essentially empty, doing a urop over the summer but i doubt i'll get much done, no extracurriculars and shit, no awards ever since high school\n", "src": "mit-summer", "id": 326, "nr-text": "when is it too late to recover from a bad start professionally? my resume is essentially empty, doing a urop over the summer but i doubt i'll get much done, no extracurriculars and shit, no awards ever since high school\n"}, {"text": "#313 it's so hard to stay quiet when you have so much to say.\n#314 it's so hard not to \"defend\" yourself when everyone is talking about you.\n#315 it's so hard to remain quiet when you are accused of something you didn't do.\n#316 but you have to because anything you say will be twisted and turned to make you seem even worse.\n#317 it's so hard to keep it together when you are powerless, for society has already made its judgment.\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#313 It's so hard to stay quiet when you have so much to say.\n#314 It's so hard not to \"defend\" yourself when everyone is talking about you.\n#315 It's so hard to remain quiet when you are accused of something you didn't do.\n#316 But you have to because anything you say will be twisted and turned to make you seem even worse.\n#317 It's so hard to keep it together when you are powerless, for society has already made its judgment.\n", "src": "mit-summer", "id": 313, "nr-text": "it's so hard to stay quiet when you have so much to say.\n#314 it's so hard not to \"defend\" yourself when everyone is talking about you.\n#315 it's so hard to remain quiet when you are accused of something you didn't do.\n#316 but you have to because anything you say will be twisted and turned to make you seem even worse.\n#317 it's so hard to keep it together when you are powerless, for society has already made its judgment.\n"}, {"text": "#312 everytime i go back home for the summer my mother is like \"oh, the girl that you will marry will be so lucky\" because i voluntarily cook half the meals, but i'm doing this mostly because i like my own cooking more than her cooking. to be fair though, i don't think most people can beat my cooking so i'd probably end up doing this for my partner as well, which... isn't too bad actually. huh.\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#312 Everytime I go back home for the summer my mother is like \"Oh, the girl that you will marry will be so lucky\" because I voluntarily cook half the meals, but I'm doing this mostly because I like my own cooking more than her cooking. To be fair though, I don't think most people can beat my cooking so I'd probably end up doing this for my partner as well, which... isn't too bad actually. Huh.\n", "src": "mit-summer", "id": 312, "nr-text": "everytime i go back home for the summer my mother is like \"oh, the girl that you will marry will be so lucky\" because i voluntarily cook half the meals, but i'm doing this mostly because i like my own cooking more than her cooking. to be fair though, i don't think most people can beat my cooking so i'd probably end up doing this for my partner as well, which... isn't too bad actually. huh.\n"}, {"text": "#328 i can't live away from mit. i can't do the grad-student thing, but campus is the only place that's safe. every time i leave it, even if i'm going home, i'm on edge the entire thing, and the smallest stimuli give me a panic attack. not \"stockholm syndrome\", just comparatively, i can deal with the shit that mit deals, but not what the rest of the world does. @literallyanyonewhosurvivesoutthere how do you do it??????\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#328 I can't live away from MIT. I can't do the grad-student thing, but campus is the only place that's safe. Every time I leave it, even if I'm going home, I'm on edge the entire thing, and the smallest stimuli give me a panic attack. Not \"Stockholm syndrome\", just comparatively, I can deal with the shit that MIT deals, but not what the rest of the world does. @literallyanyonewhosurvivesoutthere how do you do it??????\n", "src": "mit-summer", "id": 328, "nr-text": "i can't live away from mit. i can't do the grad-student thing, but campus is the only place that's safe. every time i leave it, even if i'm going home, i'm on edge the entire thing, and the smallest stimuli give me a panic attack. not \"stockholm syndrome\", just comparatively, i can deal with the shit that mit deals, but not what the rest of the world does. @literallyanyonewhosurvivesoutthere how do you do it??????\n"}, {"text": "#327 today was a great day of football! forget the big names, iceland ftw!!!\n", "date": "06/17/2018 8:59pm", "utime": 1529294340, "orig-text": "#327 Today was a great day of football! Forget the big names, Iceland FTW!!!\n", "src": "mit-summer", "id": 327, "nr-text": "today was a great day of football! forget the big names, iceland ftw!!!\n"}, {"text": "#308 what if your food budget is literally negative money. i have housing and other shit to pay for. i haven't spent a dollar on food in almost a month, all by finesse but still\n", "date": "06/16/2018 8:59pm", "utime": 1529207940, "orig-text": "#308 What if your food budget is literally negative money. I have housing and other shit to pay for. I haven't spent a dollar on food in almost a month, all by finesse but still\n", "src": "mit-summer", "id": 308, "nr-text": "what if your food budget is literally negative money. i have housing and other shit to pay for. i haven't spent a dollar on food in almost a month, all by finesse but still\n"}, {"text": "#309 for those of you in long distance relationships over the summer, how do you plan on keeping the spark between the two of you? serious responses only. its important for me to keep each other happy while we're apart and still a couple when we get back on campus.\n", "date": "06/16/2018 8:59pm", "utime": 1529207940, "orig-text": "#309 For those of you in long distance relationships over the summer, how do you plan on keeping the spark between the two of you? Serious responses only. It’s important for me to keep each other happy while we're apart and still a couple when we get back on campus.\n", "src": "mit-summer", "id": 309, "nr-text": "for those of you in long distance relationships over the summer, how do you plan on keeping the spark between the two of you? serious responses only. its important for me to keep each other happy while we're apart and still a couple when we get back on campus.\n"}, {"text": "#307 for the record nobody once hated on gd fat people, try reading. if you are fat nbd. i fr don't care one way or the other. but stop trying to make me care about you being fat when i have my own shit with immediate consequences. and i am working every day but the only job i could get is at an odd time of day and am still looking for additional work. i can relate but stfu i'm trying it's hard af coming across as sane and work-capable when you're delirious. i don't accept handouts and i don't hate fat people i'm just constantly pissed off by people complaining about their own fatness. fuck off\n", "date": "06/16/2018 8:59pm", "utime": 1529207940, "orig-text": "#307 For the record nobody once hated on GD fat people, try reading. If you are fat nbd. I fr don't care one way or the other. But stop trying to make me care about you being fat when I have my own shit with immediate consequences. And I am working every day but the only job I could get is at an odd time of day and am still looking for additional work. I can relate but stfu I'm trying it's hard af coming across as sane and work-capable when you're delirious. I don't accept handouts and I don't hate fat people I'm just constantly pissed off by people complaining about their own fatness. Fuck off\n", "src": "mit-summer", "id": 307, "nr-text": "for the record nobody once hated on gd fat people, try reading. if you are fat nbd. i fr don't care one way or the other. but stop trying to make me care about you being fat when i have my own shit with immediate consequences. and i am working every day but the only job i could get is at an odd time of day and am still looking for additional work. i can relate but stfu i'm trying it's hard af coming across as sane and work-capable when you're delirious. i don't accept handouts and i don't hate fat people i'm just constantly pissed off by people complaining about their own fatness. fuck off\n"}, {"text": "#310 spoiler alert for the incredibles 2:\n6-3 is the true villain\n", "date": "06/16/2018 8:59pm", "utime": 1529207940, "orig-text": "#310 Spoiler Alert for The Incredibles 2:\n6-3 is the true villain\n", "src": "mit-summer", "id": 310, "nr-text": "spoiler alert for the incredibles 2:\n6-3 is the true villain\n"}, {"text": "#306 the dumbest people at mit are also the most religious\n", "date": "06/16/2018 8:59pm", "utime": 1529207940, "orig-text": "#306 the dumbest people at mit are also the most religious\n", "src": "mit-summer", "id": 306, "nr-text": "the dumbest people at mit are also the most religious\n"}, {"text": "#303 remember that guy who read the bee movie script live on his facebook lmao\n#304 remember that guy who read the bee movie script live on his facebook lmao\n#305 remember that guy who read the bee movie script live on his facebook lmao\n", "date": "06/16/2018 8:59pm", "utime": 1529207940, "orig-text": "#303 remember that guy who read the Bee Movie script live on his Facebook lmao\n#304 remember that guy who read the Bee Movie script live on his Facebook lmao\n#305 remember that guy who read the Bee Movie script live on his Facebook lmao\n", "src": "mit-summer", "id": 303, "nr-text": "remember that guy who read the bee movie script live on his facebook lmao\n#304 remember that guy who read the bee movie script live on his facebook lmao\n#305 remember that guy who read the bee movie script live on his facebook lmao\n"}, {"text": "#311 hey. i know i'll never have the courage to tell you this for real, so here goes. you're one of the most amazing, inspiring people i've met. i don't understand how you do twice as much as most people academically and you also seem to be in charge of half the clubs and things on campus. but despite that, you're not above anyone. every time i talk to you, i can tell that you're so genuine and 100 present, and when we make eye contact i feel electrified because i cant believe such an incredible, beautiful person has her attention on me. even though we're just acquaintances, you've challenged me to think differently about history and the world and i hope i can become better friends with you, or more. i wanted to ask you to dance at tent parties but you looked like you were having more fun with your friends then the rest of the room combined. hopefully you know how amazing you are and realize this is about you.\n", "date": "06/16/2018 8:59pm", "utime": 1529207940, "orig-text": "#311 Hey. I know I'll never have the courage to tell you this for real, so here goes. You're one of the most amazing, inspiring people I've met. I don't understand how you do twice as much as most people academically and you also seem to be in charge of half the clubs and things on campus. But despite that, you're not above anyone. Every time I talk to you, I can tell that you're so genuine and 100% present, and when we make eye contact I feel electrified because I can’t believe such an incredible, beautiful person has her attention on me. Even though we're just acquaintances, you've challenged me to think differently about history and the world and I hope I can become better friends with you, or more. I wanted to ask you to dance at tent parties but you looked like you were having more fun with your friends then the rest of the room combined. Hopefully you know how amazing you are and realize this is about you.\n", "src": "mit-summer", "id": 311, "nr-text": "hey. i know i'll never have the courage to tell you this for real, so here goes. you're one of the most amazing, inspiring people i've met. i don't understand how you do twice as much as most people academically and you also seem to be in charge of half the clubs and things on campus. but despite that, you're not above anyone. every time i talk to you, i can tell that you're so genuine and 100 present, and when we make eye contact i feel electrified because i cant believe such an incredible, beautiful person has her attention on me. even though we're just acquaintances, you've challenged me to think differently about history and the world and i hope i can become better friends with you, or more. i wanted to ask you to dance at tent parties but you looked like you were having more fun with your friends then the rest of the room combined. hopefully you know how amazing you are and realize this is about you.\n"}, {"text": "#302 i saw somebody wearing an mit shirt in the elsmere, delaware wawa parking lot tonight. was it one of you guys? i'm lonely and need summer friends.\n", "date": "06/15/2018 9:09pm", "utime": 1529122160, "orig-text": "#302 I saw somebody wearing an MIT shirt in the Elsmere, Delaware Wawa parking lot tonight. Was it one of you guys? I'm lonely and need summer friends.\n", "src": "mit-summer", "id": 302, "nr-text": "i saw somebody wearing an mit shirt in the elsmere, delaware wawa parking lot tonight. was it one of you guys? i'm lonely and need summer friends.\n"}, {"text": "#301 it's stupid when people send dorm-wide emails asking for non-reusable things because they just don't want to buy it themselves. also, people have been selling the dumbest shit lately on emails. is 0.50 really worth the time you even spent to type that... like, just leave your moldy fruit roll-ups and used underwear in some free stuff bucket and stop trying to sell literally everything you have ever owned. no one wants to buy it.\n", "date": "06/15/2018 9:08pm", "utime": 1529122133, "orig-text": "#301 It's stupid when people send dorm-wide emails asking for non-reusable things because they just don't want to buy it themselves. Also, people have been selling the dumbest shit lately on emails. Is $0.50 really worth the time you even spent to type that... like, just leave your moldy fruit roll-ups and used underwear in some free stuff bucket and stop trying to sell literally everything you have ever owned. No one wants to buy it.\n", "src": "mit-summer", "id": 301, "nr-text": "it's stupid when people send dorm-wide emails asking for non-reusable things because they just don't want to buy it themselves. also, people have been selling the dumbest shit lately on emails. is 0.50 really worth the time you even spent to type that... like, just leave your moldy fruit roll-ups and used underwear in some free stuff bucket and stop trying to sell literally everything you have ever owned. no one wants to buy it.\n"}, {"text": "#300 where can i find some good hot pussy on campus this summer??\np.s. i'm a girl\n", "date": "06/15/2018 9:08pm", "utime": 1529122099, "orig-text": "#300 where can I find some good hot pussy on campus this summer??\nP.S. I'm a girl\n", "src": "mit-summer", "id": 300, "nr-text": "where can i find some good hot pussy on campus this summer??\np.s. i'm a girl\n"}, {"text": "#299 i usually don't comment/post but @277 made me quite upset. hating on \"\"fat\"\" people calling them privileged won't solve your food insecurity issues. i'm finding it a bit hard to understand how can someone actually be starving at mit, since there are many things you can do to prevent that from happening. as i don't know who you are, i cannot know what you've tried until now, so i'll just tell you what i did. i worked several part-time jobs simultaneously literally each and every semester since i came to mit. if you're starving and not willing to do something like this, that's still okay, just bear in mind that you're probably prioritizing something else over food/health and then you're not more \"\"oppressed\"\" than someone who has food but works their ass off to get it. i didn't like it when everybody seemed to be diligently studying or pursuing their hobbies or just chilling while i worked stupid jobs, but at least i wasn't starving. before you call me privileged or whatever, let me tell you that my family is so poor that it's me who's actually sending them money not to starve and that a good amount of the money i earn goes for expensive overseas plane ticket once per year to make my chronically ill mother a bit happier with my presence. and yes btw i probably have some extra pounds for whatever reason. turns out human issues are more complex than you seem to be thinking based on your post.\n", "date": "06/15/2018 9:06pm", "utime": 1529122005, "orig-text": "#299 I usually don't comment/post but @277 made me quite upset. Hating on \"\"fat\"\" people calling them privileged won't solve your food insecurity issues. I'm finding it a bit hard to understand how can someone actually be starving at MIT, since there are MANY things you can do to prevent that from happening. As I don't know who you are, I cannot know what you've tried until now, so I'll just tell you what I did. I worked several part-time jobs simultaneously literally each and every semester since I came to MIT. If you're starving and not willing to do something like this, that's still okay, just bear in mind that you're probably prioritizing something else over food/health and then you're not more \"\"oppressed\"\" than someone who has food but works their ass off to get it. I didn't like it when everybody seemed to be diligently studying or pursuing their hobbies or just chilling while I worked stupid jobs, but at least I wasn't starving. Before you call me privileged or whatever, let me tell you that my family is so poor that it's me who's actually sending them money not to starve and that a good amount of the money I earn goes for expensive overseas plane ticket once per year to make my chronically ill mother a bit happier with my presence. And yes btw I probably have some extra pounds for whatever reason. Turns out human issues are more complex than you seem to be thinking based on your post.\n", "src": "mit-summer", "id": 299, "nr-text": "i usually don't comment/post but @277 made me quite upset. hating on \"\"fat\"\" people calling them privileged won't solve your food insecurity issues. i'm finding it a bit hard to understand how can someone actually be starving at mit, since there are many things you can do to prevent that from happening. as i don't know who you are, i cannot know what you've tried until now, so i'll just tell you what i did. i worked several part-time jobs simultaneously literally each and every semester since i came to mit. if you're starving and not willing to do something like this, that's still okay, just bear in mind that you're probably prioritizing something else over food/health and then you're not more \"\"oppressed\"\" than someone who has food but works their ass off to get it. i didn't like it when everybody seemed to be diligently studying or pursuing their hobbies or just chilling while i worked stupid jobs, but at least i wasn't starving. before you call me privileged or whatever, let me tell you that my family is so poor that it's me who's actually sending them money not to starve and that a good amount of the money i earn goes for expensive overseas plane ticket once per year to make my chronically ill mother a bit happier with my presence. and yes btw i probably have some extra pounds for whatever reason. turns out human issues are more complex than you seem to be thinking based on your post.\n"}, {"text": "#298 still obsessed with ppap\n", "date": "06/15/2018 9:03pm", "utime": 1529121816, "orig-text": "#298 Still obsessed with PPAP\n", "src": "mit-summer", "id": 298, "nr-text": "still obsessed with ppap\n"}, {"text": "#297 i asked someone who emailed out eom what does eom mean\nshould have tried google first\n", "date": "06/15/2018 9:03pm", "utime": 1529121780, "orig-text": "#297 I asked someone who emailed out eom what does eom mean\nShould have tried google first\n", "src": "mit-summer", "id": 297, "nr-text": "i asked someone who emailed out eom what does eom mean\nshould have tried google first\n"}, {"text": "#296 wish la verdes gets replaced by cheaper convenience store\n", "date": "06/15/2018 9:02pm", "utime": 1529121736, "orig-text": "#296 Wish La Verdes gets replaced by cheaper convenience store\n", "src": "mit-summer", "id": 296, "nr-text": "wish la verdes gets replaced by cheaper convenience store\n"}, {"text": "#295 lol when mit isn't practicing what it preaches http://news.mit.edu//rabobank-mit-food-agribusiness-innova\nlow cost meal kits or even affordable grocery stores aren't on campus\n", "date": "06/15/2018 9:01pm", "utime": 1529121687, "orig-text": "#295 Lol when mit isn't practicing what it preaches http://news.mit.edu/…/rabobank-mit-food-agribusiness-innova…\nLow cost meal kits or even affordable grocery stores aren't on campus\n", "src": "mit-summer", "id": 295, "nr-text": "lol when mit isn't practicing what it preaches http://news.mit.edu//rabobank-mit-food-agribusiness-innova\nlow cost meal kits or even affordable grocery stores aren't on campus\n"}, {"text": "#294 with all the food debates on confessions, why can't people acknowledge that income, proximity to markets, affordability of nutritious foods, and sustainability of the foods produced at stable prices all matter in the diets of people, which may affect how people look.\n", "date": "06/15/2018 9:00pm", "utime": 1529121634, "orig-text": "#294 With all the food debates on confessions, why can't people acknowledge that income, proximity to markets, affordability of nutritious foods, and sustainability of the foods produced at stable prices all matter in the diets of people, which may affect how people look.\n", "src": "mit-summer", "id": 294, "nr-text": "with all the food debates on confessions, why can't people acknowledge that income, proximity to markets, affordability of nutritious foods, and sustainability of the foods produced at stable prices all matter in the diets of people, which may affect how people look.\n"}, {"text": "#293 i'm curious about how much people usually spend on food each week and how much is considered a lot/starving. i've been comfortably eating on 20 a week for some time now, 25 if you count transportation (and plus some small things like olive oil and a bag of rice that i bought at the start of the year). i was worse off in the fall and spent around 10-15 per week but i was by no means starving, although i did take advantage of consistent free food sources on campus (fruit, ramen, coffee) if i ran out of food. some people react to this like it's a tiny amount but i'm still quite healthy and keeping a consistent weight. what's a lot or a little? i'm interested in some context.\n", "date": "06/15/2018 8:59pm", "utime": 1529121582, "orig-text": "#293 I'm curious about how much people usually spend on food each week and how much is considered a lot/starving. I've been comfortably eating on $20 a week for some time now, $25 if you count transportation (and plus some small things like olive oil and a bag of rice that I bought at the start of the year). I was worse off in the fall and spent around $10-$15 per week but I was by no means starving, although I did take advantage of consistent free food sources on campus (fruit, ramen, coffee) if I ran out of food. Some people react to this like it's a tiny amount but I'm still quite healthy and keeping a consistent weight. What's a lot or a little? I'm interested in some context.\n", "src": "mit-summer", "id": 293, "nr-text": "i'm curious about how much people usually spend on food each week and how much is considered a lot/starving. i've been comfortably eating on 20 a week for some time now, 25 if you count transportation (and plus some small things like olive oil and a bag of rice that i bought at the start of the year). i was worse off in the fall and spent around 10-15 per week but i was by no means starving, although i did take advantage of consistent free food sources on campus (fruit, ramen, coffee) if i ran out of food. some people react to this like it's a tiny amount but i'm still quite healthy and keeping a consistent weight. what's a lot or a little? i'm interested in some context.\n"}, {"text": "#292 eid mubarak to all of my fellow mit muslim brothers and sisters!\n", "date": "06/15/2018 8:51pm", "utime": 1529121106, "orig-text": "#292 Eid Mubarak to all of my fellow MIT Muslim brothers and sisters!\n", "src": "mit-summer", "id": 292, "nr-text": "eid mubarak to all of my fellow mit muslim brothers and sisters!\n"}, {"text": "#291 i want to try out dd, but i've never played any tabletop rpgs before.\n", "date": "06/15/2018 8:51pm", "utime": 1529121064, "orig-text": "#291 I want to try out D&D, but I've never played any tabletop RPGs before.\n", "src": "mit-summer", "id": 291, "nr-text": "i want to try out dd, but i've never played any tabletop rpgs before.\n"}, {"text": "#290 is it normal for research supervisors to come up with really amazing ideas but then be clearly unaware of why their ideas are amazing?\n", "date": "06/15/2018 8:50pm", "utime": 1529121001, "orig-text": "#290 Is it normal for research supervisors to come up with really amazing ideas but then be clearly unaware of why their ideas are amazing?\n", "src": "mit-summer", "id": 290, "nr-text": "is it normal for research supervisors to come up with really amazing ideas but then be clearly unaware of why their ideas are amazing?\n"}, {"text": "#288 mit confessions has caused so much controversy in our frat lmo\n", "date": "06/14/2018 8:59pm", "utime": 1529035141, "orig-text": "#288 Mit confessions has caused so much controversy in our frat lmo\n", "src": "mit-summer", "id": 288, "nr-text": "mit confessions has caused so much controversy in our frat lmo\n"}, {"text": "#277 @257 please realize that not everyone gains weight because they eat excessive amounts of food.\ni didnt realize humans had the ability to photosynthesize mass out of thin air   even if you only have junk food, eat less and drink water to counteract the hunger; your body will adapt eventually. maybe also try some multivitamin or some shit if you only have processed foods. imagine being so privileged you think overeating (literally the only way to gain weight) is comparable to not having enough money to buy food at all. congrats, like most varsity athletes you discovered you cant eat 3k calories every day once you stop exercising.\ntired of fat people trying to normalize their self imposed struggle. you are not oppressed.\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#277 @257 “Please realize that not everyone gains weight because they eat excessive amounts of food.”\nI didn’t realize humans had the ability to photosynthesize mass out of thin air  🤔 Even if you only have junk food, eat less and drink water to counteract the hunger; your body will adapt eventually. Maybe also try some multivitamin or some shit if you only have processed foods. Imagine being so privileged you think overeating (literally the only way to gain weight) is comparable to not having enough money to buy food at all. Congrats, like most varsity athletes you discovered you can’t eat 3k calories every day once you stop exercising.\nTired of fat people trying to normalize their self imposed struggle. You are not oppressed.\n", "src": "mit-summer", "id": 277, "nr-text": "@257 please realize that not everyone gains weight because they eat excessive amounts of food.\ni didnt realize humans had the ability to photosynthesize mass out of thin air   even if you only have junk food, eat less and drink water to counteract the hunger; your body will adapt eventually. maybe also try some multivitamin or some shit if you only have processed foods. imagine being so privileged you think overeating (literally the only way to gain weight) is comparable to not having enough money to buy food at all. congrats, like most varsity athletes you discovered you cant eat 3k calories every day once you stop exercising.\ntired of fat people trying to normalize their self imposed struggle. you are not oppressed.\n"}, {"text": "#284 what are the best mexican restaurants to eat at near campus?\nps i'm a guy\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#284 What are the best Mexican restaurants to eat at near campus?\nPS i'm a guy\n", "src": "mit-summer", "id": 284, "nr-text": "what are the best mexican restaurants to eat at near campus?\nps i'm a guy\n"}, {"text": "#287 i feel like loneliness is such a huge problem for people once they leave college. how do you make friends in the adult world?\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#287 I feel like loneliness is such a huge problem for people once they leave college. How do you make friends in the adult world?\n", "src": "mit-summer", "id": 287, "nr-text": "i feel like loneliness is such a huge problem for people once they leave college. how do you make friends in the adult world?\n"}, {"text": "#279 i never knew boruto's dad is that strong. now i want to watch his series too.\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#279 I never knew Boruto's dad is that strong. Now I want to watch his series too.\n", "src": "mit-summer", "id": 279, "nr-text": "i never knew boruto's dad is that strong. now i want to watch his series too.\n"}, {"text": "#276 time apart during summer really makes me appreciate the little habits and tiny body language from you <3 only 2 months to go\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#276 Time apart during summer really makes me appreciate the little habits and tiny body language from you <3 Only ~2 months to go\n", "src": "mit-summer", "id": 276, "nr-text": "time apart during summer really makes me appreciate the little habits and tiny body language from you <3 only 2 months to go\n"}, {"text": "#274 the walls in my room are gorgeous but the door looks like literal garbage.\nnot a metaphor unless you want it to be.\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#274 The walls in my room are gorgeous but the door looks like literal garbage.\nNot a metaphor unless you want it to be.\n", "src": "mit-summer", "id": 274, "nr-text": "the walls in my room are gorgeous but the door looks like literal garbage.\nnot a metaphor unless you want it to be.\n"}, {"text": "#272 how did the people who did well at putnam, imo, etc reach that level of mathematical ability, while retaining their sanity? i'm sitting next to you you at mit wondering how the hell you can keep up your \"love\" of math (excluding parental pressure), while i've always felt that math was completely dry and badly taught, even at mit. how does one feel genuinely interested in what seems like such a one-dimensional field?\nproblem 1. prove x, otherwise irrelevant to your life. \nproblem 2. prove y, also otherwise irrelevant to your life.\n.....\nwho cares?\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#272 How did the people who did well at Putnam, IMO, etc reach that level of mathematical ability, while retaining their sanity? I'm sitting next to you you at MIT wondering how the hell you can keep up your \"love\" of math (excluding parental pressure), while I've always felt that math was completely dry and badly taught, even at MIT. How does one feel genuinely interested in what seems like such a one-dimensional field?\nProblem 1. Prove X, otherwise irrelevant to your life. \nProblem 2. Prove Y, also otherwise irrelevant to your life.\n.....\nWho cares?\n", "src": "mit-summer", "id": 272, "nr-text": "how did the people who did well at putnam, imo, etc reach that level of mathematical ability, while retaining their sanity? i'm sitting next to you you at mit wondering how the hell you can keep up your \"love\" of math (excluding parental pressure), while i've always felt that math was completely dry and badly taught, even at mit. how does one feel genuinely interested in what seems like such a one-dimensional field?\nproblem 1. prove x, otherwise irrelevant to your life. \nproblem 2. prove y, also otherwise irrelevant to your life.\n.....\nwho cares?\n"}, {"text": "#285 @257 compared to people like the op whose confessed about being starved, you were definitely 'rich'/'privedged' enough to be an athlete and continue getting the kind of nutrition that athletes need. #justsaying\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#285 @257 Compared to people like the OP whose confessed about being starved, you were definitely 'rich'/'privedged' enough to be an athlete and continue getting the kind of nutrition that athletes need. #justsaying\n", "src": "mit-summer", "id": 285, "nr-text": "@257 compared to people like the op whose confessed about being starved, you were definitely 'rich'/'privedged' enough to be an athlete and continue getting the kind of nutrition that athletes need. #justsaying\n"}, {"text": "#273 yo asswipe that stole my phone from the student centre lab, not cool. you know who you are. enjoy a blacklisted phone you can use as an ipod.\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#273 Yo asswipe that stole my phone from the student centre lab, not cool. You know who you are. Enjoy a blacklisted phone you can use as an iPod.\n", "src": "mit-summer", "id": 273, "nr-text": "yo asswipe that stole my phone from the student centre lab, not cool. you know who you are. enjoy a blacklisted phone you can use as an ipod.\n"}, {"text": "#281 how do i make friends that will take cute photoshoots of me?\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#281 How do I make friends that will take cute photoshoots of me?\n", "src": "mit-summer", "id": 281, "nr-text": "how do i make friends that will take cute photoshoots of me?\n"}, {"text": "#267 this summer feels so much lonelier knowing that youre here and simply chose to be with someone else. i shall be grateful though you didnt move halfway across the country only for me to feed on false hopes. the truth hungover will haunt me for a while, but eventually ill be fine.\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#267 This summer feels so much lonelier knowing that you’re here and simply chose to be with someone else. I shall be grateful though you didn’t move halfway across the country only for me to feed on false hopes. The truth hungover will haunt me for a while, but eventually I’ll be fine.\n", "src": "mit-summer", "id": 267, "nr-text": "this summer feels so much lonelier knowing that youre here and simply chose to be with someone else. i shall be grateful though you didnt move halfway across the country only for me to feed on false hopes. the truth hungover will haunt me for a while, but eventually ill be fine.\n"}, {"text": "#271 helpppp!!! i'm looking for a humanfriend.\nps. i'm a human. i'm definitely not an ai pretending to be a human.\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#271 HELPPPP!!! I'm looking for a humanfriend.\nPS. I'm a human. I'm definitely not an AI pretending to be a human.\n", "src": "mit-summer", "id": 271, "nr-text": "helpppp!!! i'm looking for a humanfriend.\nps. i'm a human. i'm definitely not an ai pretending to be a human.\n"}, {"text": "#275 when i see \"is this loss\" tags, i think of \"is this sparse cross entropy\" instead :/\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#275 When I see \"is this loss\" tags, I think of \"is this sparse cross entropy\" instead :/\n", "src": "mit-summer", "id": 275, "nr-text": "when i see \"is this loss\" tags, i think of \"is this sparse cross entropy\" instead :/\n"}, {"text": "#269 helpppp!!! i'm looking for a boyfriend.\nps. i'm a boy\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#269 HELPPPP!!! I'm looking for a boyfriend.\nPS. I'm a boy\n", "src": "mit-summer", "id": 269, "nr-text": "helpppp!!! i'm looking for a boyfriend.\nps. i'm a boy\n"}, {"text": "#289 bruh i saw incredibles 2 while baked and i walked out thinking it was a porno\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#289 Bruh I saw incredibles 2 while baked and I walked out thinking it was a porno\n", "src": "mit-summer", "id": 289, "nr-text": "bruh i saw incredibles 2 while baked and i walked out thinking it was a porno\n"}, {"text": "#278 i miss the mit confessions and mit timely confessions :(\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#278 I miss the MIT Confessions and MIT Timely Confessions :(\n", "src": "mit-summer", "id": 278, "nr-text": "i miss the mit confessions and mit timely confessions :(\n"}, {"text": "#282 soccer world cup!!!!\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#282 SOCCER WORLD CUP!!!!\n", "src": "mit-summer", "id": 282, "nr-text": "soccer world cup!!!!\n"}, {"text": "#270 @251 i can sell you names, company names, addresses, cpt start/end dates, offer letters, etc. my price is 15/person, but it's negotiable (i know, this is much more than what companies like facebook ask, but i don't have the advantage of economy of scale).\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#270 @251 I can sell you names, company names, addresses, CPT start/end dates, offer letters, etc. My price is $15/person, but it's negotiable (I know, this is much more than what companies like facebook ask, but I don't have the advantage of economy of scale).\n", "src": "mit-summer", "id": 270, "nr-text": "@251 i can sell you names, company names, addresses, cpt start/end dates, offer letters, etc. my price is 15/person, but it's negotiable (i know, this is much more than what companies like facebook ask, but i don't have the advantage of economy of scale).\n"}, {"text": "#283 @people who comment on a lot of confessions: in general, you do you, say whatever you want, if it's a source of entertainment for you that's awesome. but it makes me uncomfortable when you tag me even though i don't know you and we're not facebook friends. i know that other people might be totally fine with it, but myself and some of my friends i've talked to feel really uncomfortable with it, so i'd be super thankful if purely out of kindness and respect you would refrain from tagging people you don't know and let my/their friends do it. <3\n(also, does anyone have good explanations for why this makes me and my friends uncomfortable? i can't think of an actual good reason, i just know that it really does)\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#283 @people who comment on a lot of confessions: in general, you do you, say whatever you want, if it's a source of entertainment for you that's awesome. But it makes me uncomfortable when you tag me even though I don't know you and we're not facebook friends. I know that other people might be totally fine with it, but myself and some of my friends I've talked to feel really uncomfortable with it, so I'd be super thankful if purely out of kindness and respect you would refrain from tagging people you don't know and let my/their friends do it. <3\n(Also, does anyone have good explanations for why this makes me and my friends uncomfortable? I can't think of an actual good reason, I just know that it really does)\n", "src": "mit-summer", "id": 283, "nr-text": "@people who comment on a lot of confessions: in general, you do you, say whatever you want, if it's a source of entertainment for you that's awesome. but it makes me uncomfortable when you tag me even though i don't know you and we're not facebook friends. i know that other people might be totally fine with it, but myself and some of my friends i've talked to feel really uncomfortable with it, so i'd be super thankful if purely out of kindness and respect you would refrain from tagging people you don't know and let my/their friends do it. <3\n(also, does anyone have good explanations for why this makes me and my friends uncomfortable? i can't think of an actual good reason, i just know that it really does)\n"}, {"text": "#286 lets take the time to mourn the death of mit's hacking community. rest in peace.\nno, seriously, where did all of you go?\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#286 Lets take the time to mourn the death of MIT's hacking community. Rest in Peace.\nNo, seriously, where did all of you go?\n", "src": "mit-summer", "id": 286, "nr-text": "lets take the time to mourn the death of mit's hacking community. rest in peace.\nno, seriously, where did all of you go?\n"}, {"text": "#268 i wish i could come to terms with being an mit student and being someone that very much dislikes mit students. but damn it i'm one of these dislikable fuckers\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#268 I wish I could come to terms with being an MIT student and being someone that very much dislikes MIT students. But damn it I'm one of these dislikable fuckers\n", "src": "mit-summer", "id": 268, "nr-text": "i wish i could come to terms with being an mit student and being someone that very much dislikes mit students. but damn it i'm one of these dislikable fuckers\n"}, {"text": "#280 hey you. fuck you. yeah, you know who you are. asshole.\n", "date": "06/14/2018 8:59pm", "utime": 1529035140, "orig-text": "#280 Hey you. Fuck you. Yeah, you know who you are. Asshole.\n", "src": "mit-summer", "id": 280, "nr-text": "hey you. fuck you. yeah, you know who you are. asshole.\n"}, {"text": "#252 helpppp!!! i'm looking for some  this summer\nps. i'm a \n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#252 HELPPPP!!! I'm looking for some 🍆 this summer\nPS. I'm a 🚹\n", "src": "mit-summer", "id": 252, "nr-text": "helpppp!!! i'm looking for some  this summer\nps. i'm a \n"}, {"text": "#255 how likely is a relationship with a bu/wellesley student going to succeed?\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#255 How likely is a relationship with a BU/Wellesley student going to succeed?\n", "src": "mit-summer", "id": 255, "nr-text": "how likely is a relationship with a bu/wellesley student going to succeed?\n"}, {"text": "#250 can we start a summer mystery hunt? it's too boring on campus in the summer.\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#250 Can we start a summer mystery hunt? It's too boring on campus in the summer.\n", "src": "mit-summer", "id": 250, "nr-text": "can we start a summer mystery hunt? it's too boring on campus in the summer.\n"}, {"text": "#261 hi trey roberts! why are you so hot?\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#261 Hi Trey Roberts! Why are you so hot?\n", "src": "mit-summer", "id": 261, "nr-text": "hi trey roberts! why are you so hot?\n"}, {"text": "#245 all im doing is sucking dick. i havent had food in days. just dick.\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#245 All I’m doing is sucking dick. I haven’t had food in days. Just dick.\n", "src": "mit-summer", "id": 245, "nr-text": "all im doing is sucking dick. i havent had food in days. just dick.\n"}, {"text": "#264 someone should make a crush poll of people who are in boston so i can have that summer fling...\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#264 Someone should make a crush poll of people who are in Boston so I can have that summer fling...\n", "src": "mit-summer", "id": 264, "nr-text": "someone should make a crush poll of people who are in boston so i can have that summer fling...\n"}, {"text": "#259 misery consumes me. i hate everything. fuck.\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#259 Misery consumes me. I hate everything. Fuck.\n", "src": "mit-summer", "id": 259, "nr-text": "misery consumes me. i hate everything. fuck.\n"}, {"text": "#251 any international students on a cpt this summer?\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#251 Any international students on a CPT this summer?\n", "src": "mit-summer", "id": 251, "nr-text": "any international students on a cpt this summer?\n"}, {"text": "#253 helpppp!!! i'm looking for a girlfriend.\nps. i'm a boy\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#253 HELPPPP!!! I'm looking for a girlfriend.\nPS. I'm a boy\n", "src": "mit-summer", "id": 253, "nr-text": "helpppp!!! i'm looking for a girlfriend.\nps. i'm a boy\n"}, {"text": "#260 summer sucks when you're not here with me. \n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#260 Summer sucks when you're not here with me. ☹\n", "src": "mit-summer", "id": 260, "nr-text": "summer sucks when you're not here with me. \n"}, {"text": "#265 ngl i kinda miss all the ringcomm drama...what has summer done to me\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#265 ngl I kinda miss all the ringcomm drama...what has summer done to me\n", "src": "mit-summer", "id": 265, "nr-text": "ngl i kinda miss all the ringcomm drama...what has summer done to me\n"}, {"text": "#246 has anyone received the mitpay billing yet for june? i've been waiting for it...\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#246 Has anyone received the MITPAY billing yet for June? I've been waiting for it...\n", "src": "mit-summer", "id": 246, "nr-text": "has anyone received the mitpay billing yet for june? i've been waiting for it...\n"}, {"text": "#254 how do you get a date at mit anyway? i just don't cross path with the people i find cute and can't think of a way to start connecting with them without being totally out of the way. how?\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#254 How do you get a date at MIT anyway? I just don't cross path with the people I find cute and can't think of a way to start connecting with them without being totally out of the way. How?\n", "src": "mit-summer", "id": 254, "nr-text": "how do you get a date at mit anyway? i just don't cross path with the people i find cute and can't think of a way to start connecting with them without being totally out of the way. how?\n"}, {"text": "#256 how do i flirt?\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#256 How do I flirt?\n", "src": "mit-summer", "id": 256, "nr-text": "how do i flirt?\n"}, {"text": "#249 i dont really know how i should feel about straight people (who are self-declared straight, i aint making any assumptions here) posting solo pictures of themselves at pride. sure, its always great to have allies there, but, for some straights, i feel like its just an opportunity to dress up in cute boho clothes and have a photo shoot with rainbows. as a bi person, i feel a little disrespected if pride is being used in this way. anyone have thoughts on this? crowdsourcing ideas\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#249 I don’t really know how I should feel about straight people (who are self-declared straight, I ain’t making any assumptions here) posting solo pictures of themselves at Pride. Sure, it’s always great to have allies there, but, for some straights, I feel like it’s just an opportunity to dress up in cute boho clothes and have a photo shoot with rainbows. As a bi person, I feel a little disrespected if Pride is being used in this way. Anyone have thoughts on this? Crowdsourcing ideas\n", "src": "mit-summer", "id": 249, "nr-text": "i dont really know how i should feel about straight people (who are self-declared straight, i aint making any assumptions here) posting solo pictures of themselves at pride. sure, its always great to have allies there, but, for some straights, i feel like its just an opportunity to dress up in cute boho clothes and have a photo shoot with rainbows. as a bi person, i feel a little disrespected if pride is being used in this way. anyone have thoughts on this? crowdsourcing ideas\n"}, {"text": "#258 as a kid i'd be regularly starved. sometimes id get a questionable looking old sandwich tossed in the room i was in. i developed an eating disorder that caused me to constantly eat to avoid starvation. got here and lost all the weight related to this due to the struggles i encountered financially. quit shitting your gold bricks and realize being poor correlating to being overweight is a skewed statistic, that assumes a high enough poverty line that they have enough to afford mcdonald's which i don't. so fuck you. depends on where you make the \"poor\" cutoff. also this is every much following the trend of rich people trying to act like they have problems too so when the people that have been eating people like you's shit their whole life get fed up and revolt they can claim they stood by us. you didn't. we are separate. we are enemies. rich be damned\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#258 As a kid I'd be regularly starved. Sometimes id get a questionable looking old sandwich tossed in the room I was in. I developed an eating disorder that caused me to constantly eat to avoid starvation. Got here and lost all the weight related to this due to the struggles I encountered financially. Quit shitting your gold bricks and realize being poor correlating to being overweight is a skewed statistic, that assumes a high enough poverty line that they have enough to afford McDonald's which I don't. So fuck you. Depends on where you make the \"poor\" cutoff. Also this is every much following the trend of rich people trying to act like they have problems too so when the people that have been eating people like you's shit their whole life get fed up and revolt they can claim they stood by us. You didn't. We are separate. We are enemies. Rich be damned\n", "src": "mit-summer", "id": 258, "nr-text": "as a kid i'd be regularly starved. sometimes id get a questionable looking old sandwich tossed in the room i was in. i developed an eating disorder that caused me to constantly eat to avoid starvation. got here and lost all the weight related to this due to the struggles i encountered financially. quit shitting your gold bricks and realize being poor correlating to being overweight is a skewed statistic, that assumes a high enough poverty line that they have enough to afford mcdonald's which i don't. so fuck you. depends on where you make the \"poor\" cutoff. also this is every much following the trend of rich people trying to act like they have problems too so when the people that have been eating people like you's shit their whole life get fed up and revolt they can claim they stood by us. you didn't. we are separate. we are enemies. rich be damned\n"}, {"text": "#244 hot take: ks is just kansas and equally as exciting :o\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#244 Hot take: KS is just Kansas and equally as exciting :o\n", "src": "mit-summer", "id": 244, "nr-text": "hot take: ks is just kansas and equally as exciting :o\n"}, {"text": "#247 whenever i see a cute puppy i get the inexplicable urge to stick it in my sports bra\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#247 Whenever I see a cute puppy I get the inexplicable urge to stick it in my sports bra\n", "src": "mit-summer", "id": 247, "nr-text": "whenever i see a cute puppy i get the inexplicable urge to stick it in my sports bra\n"}, {"text": "#262 i'm sorry, we can't go back to the way we used to be. i cared about you but it turned out, you never cared back. you're saying sorry, but the truth is you don't wanna change. i should have known you will do this to me. looking back, all we did was full of good memories. when i found out what you did, i asked myself if i did shitty things. but i never did. you screwed us all this time. i wish you didn't have to do this.\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#262 I'm sorry, we can't go back to the way we used to be. I cared about you but it turned out, you never cared back. You're saying sorry, but the truth is you don't wanna change. I should have known you will do this to me. Looking back, all we did was full of good memories. When I found out what you did, I asked myself if I did shitty things. But I never did. You screwed us all this time. I wish you didn't have to do this.\n", "src": "mit-summer", "id": 262, "nr-text": "i'm sorry, we can't go back to the way we used to be. i cared about you but it turned out, you never cared back. you're saying sorry, but the truth is you don't wanna change. i should have known you will do this to me. looking back, all we did was full of good memories. when i found out what you did, i asked myself if i did shitty things. but i never did. you screwed us all this time. i wish you didn't have to do this.\n"}, {"text": "#263 every day i wish i were hit by a bus. dont deserve this life. #passive suicide crew\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#263 Every day I wish I were hit by a bus. Don’t deserve this life. #Passive suicide crew\n", "src": "mit-summer", "id": 263, "nr-text": "every day i wish i were hit by a bus. dont deserve this life. #passive suicide crew\n"}, {"text": "#248 long distance sucks, but im falling more and more in love with you every passing day. i cant wait until were together again <3\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#248 Long distance sucks, but I’m falling more and more in love with you every passing day. I can’t wait until we’re together again <3\n", "src": "mit-summer", "id": 248, "nr-text": "long distance sucks, but im falling more and more in love with you every passing day. i cant wait until were together again <3\n"}, {"text": "#257 to the people complaining about people confessing about being sad about weight gain: you don't know what these people's problems are, so back the fuck off. if you struggle being able to feed yourself, please seek out help, there are a lot of people trying to combat this issue on and off campus.\nplease realize that not everyone gains weight because they eat excessive amounts of food. actually, some studies by the nih suggest that poor people are more likely to be obese than wealthier people because of lack of access to fresh/unprocessed food. so it's not as simple as being a \"\"straight up rich ass people problems\"\". weight gain is complex. what if a person gained their weight because of medication they are on, or hormonal problems, an eating disorder, or something else? would you call them \"\"privileged as shit\"\" then? you don't know what someone is going through and you being judgmental and claiming they don't have problems because they gained weight is bullshit and makes you a true asshole.\nwhy can't people just recognize that abnormal weight gain and abnormal weight loss are just about equal problems and both can have disastrous affects on your health? for overweight people their is higher risk for diabetes, heart disease, hypertension, and other conditions, it's not just about \"\"feeling uncomfortable\"\".\ni for one, have firsthand experience with weight gain due to an injury and becoming inactive due to a long recovery process. i developed problems with my back and knees to the point where i needed surgery and had to stop playing varsity sports. i never ate excessively, and didn't change how i ate after i stopped being active but i still gained 40 pounds and my doctor said i was at risk for developing type 2 diabetes. sure i have realized that i need to change what i eat and i am working on it and changing old habits is hard, but does that make me \"\"privileged as shit\"\" because i gained weight and was upset about not being able to fit into my clothes anymore and upset that i might develop a serious long-term medical issue like diabetes? i wouldn't like to think so. people experience different levels of struggle with trying to change their eating habits for the better.\ni'm not saying that not having enough to eat is not a problem, it's certainly serious, but so is gaining a lot of weight in a short period of time. trying to delegitimize people who struggle with weight gain are just as bad as the people who try to delegitimize people with depression or other mental illnesses. though very different, both are serious medical issues that need to be addressed.\nlife isn't a race to rock bottom guys. you can recognize that 2 issues are problematic without attacking the person on the opposite side.\n", "date": "06/13/2018 8:59pm", "utime": 1528948740, "orig-text": "#257 To the people complaining about people confessing about being sad about weight gain: You don't know what these people's problems are, so back the fuck off. If you struggle being able to feed yourself, please seek out help, there are a lot of people trying to combat this issue on and off campus.\nPlease realize that not everyone gains weight because they eat excessive amounts of food. Actually, some studies by the NIH suggest that poor people are more likely to be obese than wealthier people because of lack of access to fresh/unprocessed food. So it's not as simple as being a \"\"Straight up rich ass people problems\"\". Weight gain is complex. What if a person gained their weight because of medication they are on, or hormonal problems, an eating disorder, or something else? Would you call them \"\"privileged as shit\"\" then? You don't know what someone is going through and you being judgmental and claiming they don't have problems because they gained weight is bullshit and makes you a true asshole.\nWhy can't people just recognize that abnormal weight gain and abnormal weight loss are just about equal problems and both can have disastrous affects on your health? For overweight people their is higher risk for diabetes, heart disease, hypertension, and other conditions, it's not just about \"\"feeling uncomfortable\"\".\nI for one, have firsthand experience with weight gain due to an injury and becoming inactive due to a long recovery process. I developed problems with my back and knees to the point where I needed surgery and had to stop playing varsity sports. I never ate excessively, and didn't change how I ate after I stopped being active but I still gained 40 pounds and my doctor said I was at risk for developing type 2 diabetes. Sure I have realized that I need to change what I eat and I am working on it and changing old habits is hard, but does that make me \"\"privileged as shit\"\" because I gained weight and was upset about not being able to fit into my clothes anymore and upset that I might develop a serious long-term medical issue like diabetes? I wouldn't like to think so. People experience different levels of struggle with trying to change their eating habits for the better.\nI'm not saying that not having enough to eat is not a problem, it's certainly serious, but so is gaining a lot of weight in a short period of time. Trying to delegitimize people who struggle with weight gain are just as bad as the people who try to delegitimize people with depression or other mental illnesses. Though very different, both are serious medical issues that need to be addressed.\nLife isn't a race to rock bottom guys. You can recognize that 2 issues are problematic without attacking the person on the opposite side.\n", "src": "mit-summer", "id": 257, "nr-text": "to the people complaining about people confessing about being sad about weight gain: you don't know what these people's problems are, so back the fuck off. if you struggle being able to feed yourself, please seek out help, there are a lot of people trying to combat this issue on and off campus.\nplease realize that not everyone gains weight because they eat excessive amounts of food. actually, some studies by the nih suggest that poor people are more likely to be obese than wealthier people because of lack of access to fresh/unprocessed food. so it's not as simple as being a \"\"straight up rich ass people problems\"\". weight gain is complex. what if a person gained their weight because of medication they are on, or hormonal problems, an eating disorder, or something else? would you call them \"\"privileged as shit\"\" then? you don't know what someone is going through and you being judgmental and claiming they don't have problems because they gained weight is bullshit and makes you a true asshole.\nwhy can't people just recognize that abnormal weight gain and abnormal weight loss are just about equal problems and both can have disastrous affects on your health? for overweight people their is higher risk for diabetes, heart disease, hypertension, and other conditions, it's not just about \"\"feeling uncomfortable\"\".\ni for one, have firsthand experience with weight gain due to an injury and becoming inactive due to a long recovery process. i developed problems with my back and knees to the point where i needed surgery and had to stop playing varsity sports. i never ate excessively, and didn't change how i ate after i stopped being active but i still gained 40 pounds and my doctor said i was at risk for developing type 2 diabetes. sure i have realized that i need to change what i eat and i am working on it and changing old habits is hard, but does that make me \"\"privileged as shit\"\" because i gained weight and was upset about not being able to fit into my clothes anymore and upset that i might develop a serious long-term medical issue like diabetes? i wouldn't like to think so. people experience different levels of struggle with trying to change their eating habits for the better.\ni'm not saying that not having enough to eat is not a problem, it's certainly serious, but so is gaining a lot of weight in a short period of time. trying to delegitimize people who struggle with weight gain are just as bad as the people who try to delegitimize people with depression or other mental illnesses. though very different, both are serious medical issues that need to be addressed.\nlife isn't a race to rock bottom guys. you can recognize that 2 issues are problematic without attacking the person on the opposite side.\n"}, {"text": "#240 helpppp!!! i'm looking for a boyfriend.\nps. i'm a girl\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#240 HELPPPP!!! I'm looking for a boyfriend.\nPS. I'm a girl\n", "src": "mit-summer", "id": 240, "nr-text": "helpppp!!! i'm looking for a boyfriend.\nps. i'm a girl\n"}, {"text": "#243 because someone asked the question why western men date mostly \"\"not attractive\"\" asian girls on a confession. i'm chinese and i'm currently in a relationship with a white guy from canada. growing up asian guys never liked me. i was always dorky and not 'hot' like the other asian girls. when i tried hitting on asian guys they'd give me the look like 'eww'.. yeah, that really killed my confidence. but as i got older and went to mit i noticed some guys liked me - asian, white, black. i became pickier and ended up with a canadian guy, obviously, not because he's white, but because we both have the \nsame interests, morals, and values - both non-religious, vegetarian, anti-racism, lgbt rights, gender equality, anti-capitalism, science, strong emphasis on education.\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#243 Because someone asked the question why western men date mostly \"\"not attractive\"\" Asian girls on a confession. I'm Chinese and I'm currently in a relationship with a white guy from Canada. Growing up Asian guys never liked me. I was always dorky and not 'hot' like the other Asian girls. When I tried hitting on Asian guys they'd give me the look like 'eww'.. yeah, that really killed my confidence. But as I got older and went to MIT I noticed some guys liked me - Asian, white, black. I became pickier and ended up with a Canadian guy, obviously, not because he's white, but because we both have the \nsame interests, morals, and values - both non-religious, vegetarian, anti-racism, lgbt rights, gender equality, anti-capitalism, science, strong emphasis on education.\n", "src": "mit-summer", "id": 243, "nr-text": "because someone asked the question why western men date mostly \"\"not attractive\"\" asian girls on a confession. i'm chinese and i'm currently in a relationship with a white guy from canada. growing up asian guys never liked me. i was always dorky and not 'hot' like the other asian girls. when i tried hitting on asian guys they'd give me the look like 'eww'.. yeah, that really killed my confidence. but as i got older and went to mit i noticed some guys liked me - asian, white, black. i became pickier and ended up with a canadian guy, obviously, not because he's white, but because we both have the \nsame interests, morals, and values - both non-religious, vegetarian, anti-racism, lgbt rights, gender equality, anti-capitalism, science, strong emphasis on education.\n"}, {"text": "#232 if you have a fake id, i need a summer plug...staying in ec 3 west for the summer\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#232 if you have a fake ID, i need a summer plug...staying in EC 3 West for the summer\n", "src": "mit-summer", "id": 232, "nr-text": "if you have a fake id, i need a summer plug...staying in ec 3 west for the summer\n"}, {"text": "#242 i have not received a financial aid letter. should i be scared?\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#242 I have not received a financial aid letter. Should I be scared?\n", "src": "mit-summer", "id": 242, "nr-text": "i have not received a financial aid letter. should i be scared?\n"}, {"text": "#236 despacito 2 confirmed by todd howard\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#236 Despacito 2 confirmed by Todd Howard\n", "src": "mit-summer", "id": 236, "nr-text": "despacito 2 confirmed by todd howard\n"}, {"text": "#239 nothing i hate more than looking at two extremes and saying \"oh these are two problems but they are equal, doy\". fam gaining weight and having a couple more health risks and maybe feeling uncomfortable does not begin to compare to lack of food. y'all privileged as shit. straight up rich ass people problems that you all dare try to compare to other ppls shit so u don't feel as bad for living how you do\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#239 Nothing I hate more than looking at two extremes and saying \"oh these are two problems but they are equal, doy\". Fam gaining weight and having a couple more health risks and maybe feeling uncomfortable does not begin to compare to lack of food. Y'all privileged as shit. Straight up rich ass people problems that you all dare try to compare to other ppls shit so u don't feel as bad for living how you do\n", "src": "mit-summer", "id": 239, "nr-text": "nothing i hate more than looking at two extremes and saying \"oh these are two problems but they are equal, doy\". fam gaining weight and having a couple more health risks and maybe feeling uncomfortable does not begin to compare to lack of food. y'all privileged as shit. straight up rich ass people problems that you all dare try to compare to other ppls shit so u don't feel as bad for living how you do\n"}, {"text": "#231 lmao dke only won the beaver cup cuz they went to the meetings\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#231 lmao DKE only won the beaver cup cuz they went to the meetings\n", "src": "mit-summer", "id": 231, "nr-text": "lmao dke only won the beaver cup cuz they went to the meetings\n"}, {"text": "#241 tbh now that we have the psychotic norman ai someone should make an ai machine learn from the confessions pages. i lowkey bet the result is gonna be the same.\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#241 tbh now that we have the psychotic norman AI someone should make an AI machine learn from the confessions pages. i lowkey bet the result is gonna be the same.\n", "src": "mit-summer", "id": 241, "nr-text": "tbh now that we have the psychotic norman ai someone should make an ai machine learn from the confessions pages. i lowkey bet the result is gonna be the same.\n"}, {"text": "#234 someone cuddle with me pls\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#234 someone cuddle with me pls\n", "src": "mit-summer", "id": 234, "nr-text": "someone cuddle with me pls\n"}, {"text": "#235 member when la verdes was robbed by a guy with a samurai sword? i member\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#235 Member when la verdes was robbed by a guy with a samurai sword? I member\n", "src": "mit-summer", "id": 235, "nr-text": "member when la verdes was robbed by a guy with a samurai sword? i member\n"}, {"text": "#237 i miss caitlin keegan\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#237 I MISS CAITLIN KEEGAN\n", "src": "mit-summer", "id": 237, "nr-text": "i miss caitlin keegan\n"}, {"text": "#238 i have a huge crush on alula hunsen, i wish he would talk to me more\n", "date": "06/12/2018 8:59pm", "utime": 1528862340, "orig-text": "#238 I have a huge crush on alula hunsen, I wish he would talk to me more\n", "src": "mit-summer", "id": 238, "nr-text": "i have a huge crush on alula hunsen, i wish he would talk to me more\n"}, {"text": "#226 dorm boi here. consider me.\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#226 Dorm boi here. Consider me.\n", "src": "mit-summer", "id": 226, "nr-text": "dorm boi here. consider me.\n"}, {"text": "#225 did calvin klein design the klein bottle?\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#225 Did Calvin Klein design The Klein bottle?\n", "src": "mit-summer", "id": 225, "nr-text": "did calvin klein design the klein bottle?\n"}, {"text": "#223 can guys please stop fucking ditching me? i get that we met on an app and it's not exactly supposed to be \"romance,\" but it is supposed to involve some kind of respect. all y'all suckers don't know what you're missing\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#223 Can guys please stop fucking ditching me? I get that we met on an app and it's not exactly supposed to be \"romance,\" but it IS supposed to involve some kind of respect. All y'all suckers don't know what you're missing\n", "src": "mit-summer", "id": 223, "nr-text": "can guys please stop fucking ditching me? i get that we met on an app and it's not exactly supposed to be \"romance,\" but it is supposed to involve some kind of respect. all y'all suckers don't know what you're missing\n"}, {"text": "#228 i recently graduated from mit in 3 years. part of this was that i really wanted to go to grad school, didn't think a 4th year of undergrad would be worth it, and had friends who were doing this. but a big reason that i did this was to get away from the constant, soul-crushing, unbearable pain of being ghosted by a girl with whom i was extremely close friends and also with whom i was madly in love. i hope that one day that if our paths cross again that you'll actually talk to me though i don't think you will, and i hope that you do well in whatever you do.\nalso i hope my love life is better down the road, in grad school and beyond. i want to get married and have kids. i think i have decided that love is too scary to think about it in the immediate near term, because i have a tendency to fall head over heels in love and it ends up very bad for me. it happened once in high school also. love is hard.\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#228 I recently graduated from MIT in 3 years. Part of this was that I really wanted to go to grad school, didn't think a 4th year of undergrad would be worth it, and had friends who were doing this. But a big reason that I did this was to get away from the constant, soul-crushing, unbearable pain of being ghosted by a girl with whom I was extremely close friends and also with whom I was madly in love. I hope that one day that if our paths cross again that you'll actually talk to me though I don't think you will, and I hope that you do well in whatever you do.\nAlso I hope my love life is better down the road, in grad school and beyond. I want to get married and have kids. I think I have decided that love is too scary to think about it in the immediate near term, because I have a tendency to fall head over heels in love and it ends up very bad for me. It happened once in high school also. Love is hard.\n", "src": "mit-summer", "id": 228, "nr-text": "i recently graduated from mit in 3 years. part of this was that i really wanted to go to grad school, didn't think a 4th year of undergrad would be worth it, and had friends who were doing this. but a big reason that i did this was to get away from the constant, soul-crushing, unbearable pain of being ghosted by a girl with whom i was extremely close friends and also with whom i was madly in love. i hope that one day that if our paths cross again that you'll actually talk to me though i don't think you will, and i hope that you do well in whatever you do.\nalso i hope my love life is better down the road, in grad school and beyond. i want to get married and have kids. i think i have decided that love is too scary to think about it in the immediate near term, because i have a tendency to fall head over heels in love and it ends up very bad for me. it happened once in high school also. love is hard.\n"}, {"text": "#227 tfw your depression wants you to sleep for 12 hours but your anxiety tells you to not sleep at all. so you sleep a comfortable 6 hours a day!\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#227 TFW your depression wants you to sleep for 12 hours but your anxiety tells you to not sleep at all. So you sleep a comfortable 6 hours a day!\n", "src": "mit-summer", "id": 227, "nr-text": "tfw your depression wants you to sleep for 12 hours but your anxiety tells you to not sleep at all. so you sleep a comfortable 6 hours a day!\n"}, {"text": "#229 good thing i found you on the street- friend that found me on the street\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#229 “Good thing i found you on the street”- friend that found me on the street\n", "src": "mit-summer", "id": 229, "nr-text": "good thing i found you on the street- friend that found me on the street\n"}, {"text": "#230 @128 and now it's not even the 2nd best either\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#230 @128 and now it's not even the 2nd best either\n", "src": "mit-summer", "id": 230, "nr-text": "@128 and now it's not even the 2nd best either\n"}, {"text": "#224 a lot of relationships sour during the summer because one or more members of the relationship \"forgets\" to contact the other. they don't break off entirely, but they just stay bad for a long time.\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#224 A lot of relationships sour during the summer because one or more members of the relationship \"forgets\" to contact the other. They don't break off entirely, but they just stay bad for a long time.\n", "src": "mit-summer", "id": 224, "nr-text": "a lot of relationships sour during the summer because one or more members of the relationship \"forgets\" to contact the other. they don't break off entirely, but they just stay bad for a long time.\n"}, {"text": "#222 @219 i know people who have been assualted at all three of those frats so you may want to rethink your rankings. tbh those three and a couple others are the lowest of the low.\n", "date": "06/11/2018 8:59pm", "utime": 1528775940, "orig-text": "#222 @219 I know people who have been assualted at all three of those frats so you may want to rethink your rankings. Tbh those three and a couple others are the lowest of the low.\n", "src": "mit-summer", "id": 222, "nr-text": "@219 i know people who have been assualted at all three of those frats so you may want to rethink your rankings. tbh those three and a couple others are the lowest of the low.\n"}, {"text": "#219 prefrosh here....lots of people are talking about delts in our 2022 group chat for greek life. what is frat culture like at mit? which are the nice frat? the nicest we have are delts, pbe and chi phi\n", "date": "06/10/2018 8:59pm", "utime": 1528689541, "orig-text": "#219 Prefrosh here....lots of people are talking about Delts in our 2022 group chat for Greek life. What is frat culture like at MIT? Which are the nice frat? The nicest we have are Delts, PBE and Chi Phi\n", "src": "mit-summer", "id": 219, "nr-text": "prefrosh here....lots of people are talking about delts in our 2022 group chat for greek life. what is frat culture like at mit? which are the nice frat? the nicest we have are delts, pbe and chi phi\n"}, {"text": "#214 just said a little prayer to the universe that the next timely warning details the people playing frisbee outside obnoxiously screaming and clapping like disabled seals being assaulted by someone with a bat\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#214 Just said a little prayer to the universe that the next Timely Warning details the people playing frisbee outside obnoxiously screaming and clapping like disabled seals being assaulted by someone with a bat\n", "src": "mit-summer", "id": 214, "nr-text": "just said a little prayer to the universe that the next timely warning details the people playing frisbee outside obnoxiously screaming and clapping like disabled seals being assaulted by someone with a bat\n"}, {"text": "#213 i just met one of the summer tenants for the first time and she is so gorgeous. please hit me up, i want to get to know you more.\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#213 I just met one of the summer tenants for the first time and she is so gorgeous. Please hit me up, I want to get to know you more.\n", "src": "mit-summer", "id": 213, "nr-text": "i just met one of the summer tenants for the first time and she is so gorgeous. please hit me up, i want to get to know you more.\n"}, {"text": "#216 job training has made me realize how weird boston is. just after training hours i have been getting like 10x more people checking me out per capita than at school\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#216 Job training has made me realize how weird Boston is. Just after training hours I have been getting like 10x more people checking me out per capita than at school\n", "src": "mit-summer", "id": 216, "nr-text": "job training has made me realize how weird boston is. just after training hours i have been getting like 10x more people checking me out per capita than at school\n"}, {"text": "#215 ive hooked up with four guys at the frat im staying at this summer already.\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#215 I’ve hooked up with four guys at the frat I’m staying at this summer already.\n", "src": "mit-summer", "id": 215, "nr-text": "ive hooked up with four guys at the frat im staying at this summer already.\n"}, {"text": "#212 lol my boyfriend and i are long distance for the summer but i think im always the one reaching out to talk and share my day. i feel like he does not really make an effort. rip us?\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#212 lol my boyfriend and i are long distance for the summer but I think I’m always the one reaching out to talk and share my day. i feel like he does not really make an effort. Rip us?\n", "src": "mit-summer", "id": 212, "nr-text": "lol my boyfriend and i are long distance for the summer but i think im always the one reaching out to talk and share my day. i feel like he does not really make an effort. rip us?\n"}, {"text": "#211 i want to be simultaneously cuddled and rammed in the ass by ryan gosling\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#211 i want to be simultaneously cuddled and rammed in the ass by ryan gosling\n", "src": "mit-summer", "id": 211, "nr-text": "i want to be simultaneously cuddled and rammed in the ass by ryan gosling\n"}, {"text": "#210 @197 hello, i have lived in mccormick my entire time at mit and while i am not white (i am not even from america), i do think that your comment is very racist and unwarranted. raul and flavia are the best parents anyone can ask for in a stressful place like mit; have you ever shown up to any of the events they have hosted? house gov is open to any and everybody and the team always sends emails out to encourage people to get people more involved; if you want to diversify it, why don't you sign up and join? i personally think they are the least clickly people i have met; i don't even know them personally but they still say hi whenever you go to events. please get your facts right before laying claims. thank you.\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#210 @197 Hello, I have lived in McCormick my entire time at MIT and while I am not white (I am not even from America), I do think that your comment is very racist and unwarranted. Raul and Flavia are the best parents anyone can ask for in a stressful place like MIT; have you ever shown up to any of the events they have hosted? House Gov is open to any and everybody and the team always sends emails out to encourage people to get people more involved; if you want to diversify it, why don't you sign up and join? I personally think they are the LEAST clickly people I have met; I don't even know them personally but they still say hi whenever you go to events. Please get your facts right before laying claims. Thank you.\n", "src": "mit-summer", "id": 210, "nr-text": "@197 hello, i have lived in mccormick my entire time at mit and while i am not white (i am not even from america), i do think that your comment is very racist and unwarranted. raul and flavia are the best parents anyone can ask for in a stressful place like mit; have you ever shown up to any of the events they have hosted? house gov is open to any and everybody and the team always sends emails out to encourage people to get people more involved; if you want to diversify it, why don't you sign up and join? i personally think they are the least clickly people i have met; i don't even know them personally but they still say hi whenever you go to events. please get your facts right before laying claims. thank you.\n"}, {"text": "#217 california is officially a cool state\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#217 California is officially a cool state\n", "src": "mit-summer", "id": 217, "nr-text": "california is officially a cool state\n"}, {"text": "#221 maseeh latina girl 2020 unaffiliated....you are so nice and i was wondering if youre single and into 2021s\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#221 Maseeh Latina girl 2020 unaffiliated....you are so nice and I was wondering if you’re single and into 2021s\n", "src": "mit-summer", "id": 221, "nr-text": "maseeh latina girl 2020 unaffiliated....you are so nice and i was wondering if youre single and into 2021s\n"}, {"text": "#218 tag your bp tournament partner\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#218 Tag your BP tournament partner\n", "src": "mit-summer", "id": 218, "nr-text": "tag your bp tournament partner\n"}, {"text": "#220 damn beer is so cheap and accessible out side of boston\n", "date": "06/10/2018 8:59pm", "utime": 1528689540, "orig-text": "#220 Damn beer is so cheap and accessible out side of Boston\n", "src": "mit-summer", "id": 220, "nr-text": "damn beer is so cheap and accessible out side of boston\n"}, {"text": "#198 my frat has female summer boarders, and some of them are so hot. is it wrong to hit on them? can i hit on them? how do i hit on them?\n", "date": "06/09/2018 8:59pm", "utime": 1528603141, "orig-text": "#198 My frat has female summer boarders, and some of them are so hot. Is it wrong to hit on them? Can I hit on them? How do I hit on them?\n", "src": "mit-summer", "id": 198, "nr-text": "my frat has female summer boarders, and some of them are so hot. is it wrong to hit on them? can i hit on them? how do i hit on them?\n"}, {"text": "#197 so happy to be out of mccormick and its arrogant and exclusive house gov of white girls and white girl wannabes. for a diverse dorm its sad how the house gov and housemasters are so clickly and not nice.\n", "date": "06/09/2018 8:59pm", "utime": 1528603141, "orig-text": "#197 So happy to be out of McCormick and it’s arrogant and exclusive House gov of white girls and white girl wannabes. For a diverse dorm it’s sad how the house gov and housemasters are so clickly and not nice.\n", "src": "mit-summer", "id": 197, "nr-text": "so happy to be out of mccormick and its arrogant and exclusive house gov of white girls and white girl wannabes. for a diverse dorm its sad how the house gov and housemasters are so clickly and not nice.\n"}, {"text": "#201 damn, alexis oriole is thicccc with like 30 cs. how is she still single?\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#201 Damn, Alexis Oriole is thicccc with like 30 c’s. How is she still single?\n", "src": "mit-summer", "id": 201, "nr-text": "damn, alexis oriole is thicccc with like 30 cs. how is she still single?\n"}, {"text": "#204 can pkt please get their shit together and stop getting burglarized. i'm tired of my email being spammed by all these warnings.\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#204 Can PKT please get their shit together and stop getting burglarized. I'm tired of my email being spammed by all these warnings.\n", "src": "mit-summer", "id": 204, "nr-text": "can pkt please get their shit together and stop getting burglarized. i'm tired of my email being spammed by all these warnings.\n"}, {"text": "#200 im so bad at being single...someone get me a hot bf\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#200 I’m so bad at being single...someone get me a hot bf\n", "src": "mit-summer", "id": 200, "nr-text": "im so bad at being single...someone get me a hot bf\n"}, {"text": "#199 people gotta stop joining frats and sororities thinking they are about anything other than drinking and partying. these arent fucking intellectual or emotional development clubs\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#199 People gotta stop joining frats and sororities thinking they are about anything other than drinking and partying. These aren’t fucking intellectual or emotional development clubs\n", "src": "mit-summer", "id": 199, "nr-text": "people gotta stop joining frats and sororities thinking they are about anything other than drinking and partying. these arent fucking intellectual or emotional development clubs\n"}, {"text": "#202 after my 4th relationship (just broke up, sigh), i'm convinced that most guys here at mit are too busy to put nearly enough attention into a relationship.\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#202 After my 4th relationship (just broke up, sigh), I'm convinced that most guys here at MIT are too busy to put nearly enough attention into a relationship.\n", "src": "mit-summer", "id": 202, "nr-text": "after my 4th relationship (just broke up, sigh), i'm convinced that most guys here at mit are too busy to put nearly enough attention into a relationship.\n"}, {"text": "#207 all my relatives at graduation seem to think hook up means to meet up\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#207 All my relatives at graduation seem to think “hook up” means to meet up\n", "src": "mit-summer", "id": 207, "nr-text": "all my relatives at graduation seem to think hook up means to meet up\n"}, {"text": "#205 any husky owners here aside from me?\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#205 Any Husky owners here aside from me?\n", "src": "mit-summer", "id": 205, "nr-text": "any husky owners here aside from me?\n"}, {"text": "#209 its really not hard to keep up with your friends over summer like ya you dont see them every day now but dont just ghost cause things wont be the same in fall\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#209 It’s really not hard to keep up with your friends over summer like ya you don’t see them every day now but don’t just ghost cause things won’t be the same in fall\n", "src": "mit-summer", "id": 209, "nr-text": "its really not hard to keep up with your friends over summer like ya you dont see them every day now but dont just ghost cause things wont be the same in fall\n"}, {"text": "#208 swe is a super sketch organization. it has a great mission, but unfortunately an exec team that invests a lot of money into its internal team as opposed to the community. i mean, all the bonding events, grants, fellowships, scholarships end all being exclusive to swe exec members only. what's the point of emailing those opportunities out, if you're going to end up hoarding the money for yourselves anyway? :(\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#208 swe is a super sketch organization. it has a great mission, but unfortunately an exec team that invests a lot of money into its internal team as opposed to the community. I mean, all the bonding events, grants, fellowships, scholarships end all being exclusive to SWE exec members only. what's the point of emailing those opportunities out, if you're going to end up hoarding the money for yourselves anyway? :(\n", "src": "mit-summer", "id": 208, "nr-text": "swe is a super sketch organization. it has a great mission, but unfortunately an exec team that invests a lot of money into its internal team as opposed to the community. i mean, all the bonding events, grants, fellowships, scholarships end all being exclusive to swe exec members only. what's the point of emailing those opportunities out, if you're going to end up hoarding the money for yourselves anyway? :(\n"}, {"text": "#203 ok people, sorry if this is a dumb or obvious question but what are some common reasons why people don't graduate on time? how does the mit administration handle these cases and do they make any accommodations? i personally think that not graduating on time is not a bad thing, just like taking a year off is not. however my visa expires at the time when i'm supposed to graduate so i'm trying to be on track with things.\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#203 Ok people, sorry if this is a dumb or obvious question but what are some common reasons why people don't graduate on time? How does the MIT administration handle these cases and do they make any accommodations? I personally think that not graduating on time is not a bad thing, just like taking a year off is not. However my visa expires at the time when I'm supposed to graduate so I'm trying to be on track with things.\n", "src": "mit-summer", "id": 203, "nr-text": "ok people, sorry if this is a dumb or obvious question but what are some common reasons why people don't graduate on time? how does the mit administration handle these cases and do they make any accommodations? i personally think that not graduating on time is not a bad thing, just like taking a year off is not. however my visa expires at the time when i'm supposed to graduate so i'm trying to be on track with things.\n"}, {"text": "#206 to the bitch in east campus who thinks mit is safe: you're wrong... there have been so many burglaries and rapes on campus. i just got another email about one today.\n", "date": "06/09/2018 8:59pm", "utime": 1528603140, "orig-text": "#206 To the bitch in east campus who thinks MIT is safe: You're wrong... There have been so many burglaries and rapes on campus. I JUST GOT ANOTHER EMAIL ABOUT ONE TODAY.\n", "src": "mit-summer", "id": 206, "nr-text": "to the bitch in east campus who thinks mit is safe: you're wrong... there have been so many burglaries and rapes on campus. i just got another email about one today.\n"}, {"text": "#187 the summer had just started for me and im no longer connecting with my friend group on a daily basis. what if i go back during the fall and find us no longer friends? its terrifying to think about the uncertainties of the future, and i dont see a way out.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#187 The summer had just started for me and I’m no longer connecting with my friend group on a daily basis. What if I go back during the fall and find us no longer friends? It’s terrifying to think about the uncertainties of the future, and I don’t see a way out.\n", "src": "mit-summer", "id": 187, "nr-text": "the summer had just started for me and im no longer connecting with my friend group on a daily basis. what if i go back during the fall and find us no longer friends? its terrifying to think about the uncertainties of the future, and i dont see a way out.\n"}, {"text": "#194 as an international student i have to say that i find it really interesting that some people that i've met at mit, most of them who are from middle and upper-middle class households, talk and write about white privilege but don't \nwant to acknowledge their economic privilege or their privilege as an mit graduate. yes, a non-white mit graduate has less privilege than a white mit graduate (even though i would argue that for example a chinese mit graduate has far more job opportunities in singapore, taiwan or china than a \"white\" graduate) but the average person, no matter if he/she is white, black or asian, who goes to a less prestigious university or doesn't even have a college degree has it a lot worse. even the fact that you live in the united states makes you far more privileged than 80 of people across the globe. it makes you also more privileged than white people who live in less developed countries like ukraine or russia. i find it personally totally ok if you don't want to acknowledge your privileges but it's inconsistent and hypocritcal of you to talk about white privilege without recognizing your own economic privilege. i know that my argument will be dismissed anyway by certain people here but i hope that at least some people understand where i'm coming from.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#194 As an international student I have to say that I find it really interesting that some people that I've met at MIT, most of them who are from middle and upper-middle class households, talk and write about white privilege but don't \nwant to acknowledge their economic privilege or their privilege as an MIT graduate. Yes, a non-white MIT graduate has less privilege than a white MIT graduate (even though I would argue that for example a Chinese MIT graduate has far more job opportunities in Singapore, Taiwan or China than a \"white\" graduate) but the average person, no matter if he/she is white, black or Asian, who goes to a less prestigious university or doesn't even have a college degree has it a lot worse. Even the fact that you live in the United States makes you far more privileged than 80% of people across the globe. It makes you also more privileged than white people who live in less developed countries like Ukraine or Russia. I find it personally totally ok if you don't want to acknowledge your privileges but it's inconsistent and hypocritcal of you to talk about white privilege without recognizing your own economic privilege. I know that my argument will be dismissed anyway by certain people here but I hope that at least some people understand where I'm coming from.\n", "src": "mit-summer", "id": 194, "nr-text": "as an international student i have to say that i find it really interesting that some people that i've met at mit, most of them who are from middle and upper-middle class households, talk and write about white privilege but don't \nwant to acknowledge their economic privilege or their privilege as an mit graduate. yes, a non-white mit graduate has less privilege than a white mit graduate (even though i would argue that for example a chinese mit graduate has far more job opportunities in singapore, taiwan or china than a \"white\" graduate) but the average person, no matter if he/she is white, black or asian, who goes to a less prestigious university or doesn't even have a college degree has it a lot worse. even the fact that you live in the united states makes you far more privileged than 80 of people across the globe. it makes you also more privileged than white people who live in less developed countries like ukraine or russia. i find it personally totally ok if you don't want to acknowledge your privileges but it's inconsistent and hypocritcal of you to talk about white privilege without recognizing your own economic privilege. i know that my argument will be dismissed anyway by certain people here but i hope that at least some people understand where i'm coming from.\n"}, {"text": "#192 jacob, i just wanted to tell you that i love you and your white boy aesthetic. and your beautiful sneakers.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#192 Jacob, I just wanted to tell you that I love you and your white boy aesthetic. And your beautiful sneakers.\n", "src": "mit-summer", "id": 192, "nr-text": "jacob, i just wanted to tell you that i love you and your white boy aesthetic. and your beautiful sneakers.\n"}, {"text": "#185 we win in all caps!!!!!\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#185 WE WIN IN ALL CAPS!!!!!\n", "src": "mit-summer", "id": 185, "nr-text": "we win in all caps!!!!!\n"}, {"text": "#193 literally so sick of getting all these congratulation emails for graduation. stopppp please i just want to not graduate in peace, jesus christ.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#193 Literally so sick of getting all these congratulation emails for graduation. Stopppp please I just want to not graduate in peace, Jesus Christ.\n", "src": "mit-summer", "id": 193, "nr-text": "literally so sick of getting all these congratulation emails for graduation. stopppp please i just want to not graduate in peace, jesus christ.\n"}, {"text": "#186 i'm a 2018 that isn't graduating this year, and i don't know how to be happy for my friends without being really sad for myself. honestly, it seems like i'm torturing myself by being around them and on social media because everyone else knows how to life and is graduating on time. and here i am, an utter failure because i can't keep my mental health under control. honestly, i'm struggling to find a will to continue. people say don't compare yourself to others, but that's easier said than done. i know that i am failing, that i won't have much of a future even if i do graduate, and that my family is ashamed of the waste of time, love and money that they put into me. i don't know how to feel happy for my friends and classmates because they just serve as a reminder of my incompetence, lack of intelligence, and mental instability. i wish i hadn't gone to senior ball, senior week, senior photoshoots, etc because i had to constantly explain why i wasn't graduating and how i was feeling about that. i don't know how to deal with the disapproving pitying looks, the \"oh\"s and the \"really?\"s. and, i feel like no one else in my class feels the same way. i feel like no one else has dealt with the same thing (though i know they have); it's a very lonely feeling. it sucks to be behind in life, and more so when you feel like life isn't even moving forward at all. i don't know what to do. i feel shitty, and shitty feelings is what got me into this mess.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#186 I'm a 2018 that isn't graduating this year, and I don't know how to be happy for my friends without being really sad for myself. Honestly, it seems like I'm torturing myself by being around them and on social media because everyone else knows how to life and is graduating on time. And here I am, an utter failure because I can't keep my mental health under control. Honestly, I'm struggling to find a will to continue. People say don't compare yourself to others, but that's easier said than done. I know that I am failing, that I won't have much of a future even if I do graduate, and that my family is ashamed of the waste of time, love and money that they put into me. I don't know how to feel happy for my friends and classmates because they just serve as a reminder of my incompetence, lack of intelligence, and mental instability. I wish I hadn't gone to senior ball, senior week, senior photoshoots, etc because I had to constantly explain why I wasn't graduating and how I was feeling about that. I don't know how to deal with the disapproving pitying looks, the \"oh\"s and the \"really?\"s. And, I feel like no one else in my class feels the same way. I *feel* like no one else has dealt with the same thing (though I know they have); it's a very lonely feeling. It sucks to be behind in life, and more so when you feel like life isn't even moving forward at all. I don't know what to do. I feel shitty, and shitty feelings is what got me into this mess.\n", "src": "mit-summer", "id": 186, "nr-text": "i'm a 2018 that isn't graduating this year, and i don't know how to be happy for my friends without being really sad for myself. honestly, it seems like i'm torturing myself by being around them and on social media because everyone else knows how to life and is graduating on time. and here i am, an utter failure because i can't keep my mental health under control. honestly, i'm struggling to find a will to continue. people say don't compare yourself to others, but that's easier said than done. i know that i am failing, that i won't have much of a future even if i do graduate, and that my family is ashamed of the waste of time, love and money that they put into me. i don't know how to feel happy for my friends and classmates because they just serve as a reminder of my incompetence, lack of intelligence, and mental instability. i wish i hadn't gone to senior ball, senior week, senior photoshoots, etc because i had to constantly explain why i wasn't graduating and how i was feeling about that. i don't know how to deal with the disapproving pitying looks, the \"oh\"s and the \"really?\"s. and, i feel like no one else in my class feels the same way. i feel like no one else has dealt with the same thing (though i know they have); it's a very lonely feeling. it sucks to be behind in life, and more so when you feel like life isn't even moving forward at all. i don't know what to do. i feel shitty, and shitty feelings is what got me into this mess.\n"}, {"text": "#189 life is a riddle. happiness is ephemeral.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#189 Life is a riddle. Happiness is ephemeral.\n", "src": "mit-summer", "id": 189, "nr-text": "life is a riddle. happiness is ephemeral.\n"}, {"text": "#190 whenever my man asks to video chat after saying he is horny, i can't help but think he is just asking to jerk off.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#190 Whenever my man asks to video chat after saying he is horny, I can't help but think he is just asking to jerk off.\n", "src": "mit-summer", "id": 190, "nr-text": "whenever my man asks to video chat after saying he is horny, i can't help but think he is just asking to jerk off.\n"}, {"text": "#196 unpopular opinion: im in a sorority and i appreciate the mixers where the guys arent drunk by the time we get there and we can really get to know them over snacks or karaoke and there isnt alcohol or pressure to pregame\nhonestly, we need more gentleman where the guys want to get to know us as human women and people of mit, not vaginas\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#196 Unpopular opinion: I’m in a sorority and I appreciate the mixers where the guys aren’t drunk by the time we get there and we can really get to know them over snacks or karaoke and there isn’t alcohol or pressure to pregame\nHonestly, we need more gentleman where the guys want to get to know us as human women and people of MIT, not vaginas\n", "src": "mit-summer", "id": 196, "nr-text": "unpopular opinion: im in a sorority and i appreciate the mixers where the guys arent drunk by the time we get there and we can really get to know them over snacks or karaoke and there isnt alcohol or pressure to pregame\nhonestly, we need more gentleman where the guys want to get to know us as human women and people of mit, not vaginas\n"}, {"text": "#188 elf practice is a good meme. change my mind.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#188 Elf practice is a good meme. Change my mind.\n", "src": "mit-summer", "id": 188, "nr-text": "elf practice is a good meme. change my mind.\n"}, {"text": "#195 i don't know why, but this morning i woke up and thought to myself, you know what? i need an orangey-yellowy t-shirt. maybe a v neck? i'm not sure, but i don't own anything yellow or orange and today is the day.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#195 I don't know why, but this morning I woke up and thought to myself, you know what? I need an orangey-yellowy t-shirt. Maybe a v neck? I'm not sure, but I don't own anything yellow or orange and today is the day.\n", "src": "mit-summer", "id": 195, "nr-text": "i don't know why, but this morning i woke up and thought to myself, you know what? i need an orangey-yellowy t-shirt. maybe a v neck? i'm not sure, but i don't own anything yellow or orange and today is the day.\n"}, {"text": "#191 i need a guy who likes dogs. where are you?\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#191 I need a guy who likes dogs. Where are you?\n", "src": "mit-summer", "id": 191, "nr-text": "i need a guy who likes dogs. where are you?\n"}, {"text": "#184 i need to stop pretending to be sleepy to avoid social situations. i'm already actually sleepy enough of the time.\n", "date": "06/08/2018 8:59pm", "utime": 1528516740, "orig-text": "#184 I need to stop pretending to be sleepy to avoid social situations. I'm already actually sleepy enough of the time.\n", "src": "mit-summer", "id": 184, "nr-text": "i need to stop pretending to be sleepy to avoid social situations. i'm already actually sleepy enough of the time.\n"}, {"text": "#183 what can a guy do to get some decent cock around here?\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#183 What can a guy do to get some decent cock around here?\n", "src": "mit-summer", "id": 183, "nr-text": "what can a guy do to get some decent cock around here?\n"}, {"text": "#176 leave it to me to talk to my crush a week before i never see them again rip\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#176 Leave it to me to talk to my crush a week before I never see them again rip\n", "src": "mit-summer", "id": 176, "nr-text": "leave it to me to talk to my crush a week before i never see them again rip\n"}, {"text": "#182 can anyone suggest some math-y course 6 shit for me to read casually over the summer? i just need an escape from my crappy everyday life.\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#182 Can anyone suggest some math-y course 6 shit for me to read casually over the summer? I just need an escape from my crappy everyday life.\n", "src": "mit-summer", "id": 182, "nr-text": "can anyone suggest some math-y course 6 shit for me to read casually over the summer? i just need an escape from my crappy everyday life.\n"}, {"text": "#175 summer vacation just started and i miss jared tramontano so bad! :(((\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#175 Summer vacation just started and I miss Jared Tramontano so bad! :(((\n", "src": "mit-summer", "id": 175, "nr-text": "summer vacation just started and i miss jared tramontano so bad! :(((\n"}, {"text": "#172 i broke my office computer on my first week of internship, halp\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#172 I broke my office computer on my first week of internship, halp\n", "src": "mit-summer", "id": 172, "nr-text": "i broke my office computer on my first week of internship, halp\n"}, {"text": "#169 where's the math lounge dude when you need him over the summer?\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#169 Where's the math lounge dude when you need him over the summer?\n", "src": "mit-summer", "id": 169, "nr-text": "where's the math lounge dude when you need him over the summer?\n"}, {"text": "#170 if i hate someone, you better hate them back. that's what friends are for.\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#170 If I hate someone, you better hate them back. That's what friends are for.\n", "src": "mit-summer", "id": 170, "nr-text": "if i hate someone, you better hate them back. that's what friends are for.\n"}, {"text": "#178 petition to break up the 2021 group to mit 2021 and mit 2021 calendar? lets be real, its getting excessive.\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#178 Petition to break up the 2021 group to MIT 2021 and MIT 2021 Calendar? Lets be real, its getting excessive.\n", "src": "mit-summer", "id": 178, "nr-text": "petition to break up the 2021 group to mit 2021 and mit 2021 calendar? lets be real, its getting excessive.\n"}, {"text": "#171 what are all these lies about people thirsting during senior week, i'm out here tryna smash and people are just like \n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#171 What are all these lies about people thirsting during senior week, I'm out here tryna smash and people are just like 👀\n", "src": "mit-summer", "id": 171, "nr-text": "what are all these lies about people thirsting during senior week, i'm out here tryna smash and people are just like \n"}, {"text": "#180 shout out to all the 2018s and below (2017s, 2016s, etc) that aren't graduating tomorrow!!! regardless of your circumstances you are not a failure (like hello you literally got into mit) and you will be as successful as everyone graduating this year. it kind of hurts scrolling through my facebook timeline seeing all my 2018 friends posting cap and gown and senior week pics, but knowing that there are so many of us out there in the same boat makes me feel better (and i hope this post might help anyone else out there feel better too)\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#180 Shout out to all the 2018s and below (2017s, 2016s, etc) that AREN'T graduating tomorrow!!! Regardless of your circumstances you are NOT a failure (like hello you literally got into MIT) and you will be as successful as everyone graduating this year. It kind of hurts scrolling through my facebook timeline seeing all my 2018 friends posting cap and gown and senior week pics, but knowing that there are so many of us out there in the same boat makes me feel better (and I hope this post might help anyone else out there feel better too)\n", "src": "mit-summer", "id": 180, "nr-text": "shout out to all the 2018s and below (2017s, 2016s, etc) that aren't graduating tomorrow!!! regardless of your circumstances you are not a failure (like hello you literally got into mit) and you will be as successful as everyone graduating this year. it kind of hurts scrolling through my facebook timeline seeing all my 2018 friends posting cap and gown and senior week pics, but knowing that there are so many of us out there in the same boat makes me feel better (and i hope this post might help anyone else out there feel better too)\n"}, {"text": "#173 what does ihtfp even mean? i heart trading for points?\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#173 What does IHTFP even mean? I Heart Trading For Points?\n", "src": "mit-summer", "id": 173, "nr-text": "what does ihtfp even mean? i heart trading for points?\n"}, {"text": "#181 tdc summer housing fucking sucks\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#181 TDC summer housing fucking sucks\n", "src": "mit-summer", "id": 181, "nr-text": "tdc summer housing fucking sucks\n"}, {"text": "#177 victoria, you're a lovely friend! <3 stay wonderful <3\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#177 Victoria, you're a lovely friend! <3 Stay wonderful <3\n", "src": "mit-summer", "id": 177, "nr-text": "victoria, you're a lovely friend! <3 stay wonderful <3\n"}, {"text": "#174 my parents obsess over me finding the perfect husband for the express purpose of \"passing down the family's genes\" and having perfect little children. their worst fear has always been that i turn out gay and adopt a kid or something. however, i'm like super lesbian. what do?\n", "date": "06/07/2018 8:59pm", "utime": 1528430340, "orig-text": "#174 My parents obsess over me finding the perfect husband for the express purpose of \"passing down the family's genes\" and having perfect little children. Their worst fear has always been that I turn out gay and adopt a kid or something. However, I'm like super lesbian. What do?\n", "src": "mit-summer", "id": 174, "nr-text": "my parents obsess over me finding the perfect husband for the express purpose of \"passing down the family's genes\" and having perfect little children. their worst fear has always been that i turn out gay and adopt a kid or something. however, i'm like super lesbian. what do?\n"}, {"text": "#167 i want to get an iud bc periods are a bitch\n", "date": "06/06/2018 9:36pm", "utime": 1528346163, "orig-text": "#167 I want to get an IUD bc periods are a bitch\n", "src": "mit-summer", "id": 167, "nr-text": "i want to get an iud bc periods are a bitch\n"}, {"text": "#168 trang you always look like a whole damn snack \n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#168 Trang you always look like a whole damn snack 😍\n", "src": "mit-summer", "id": 168, "nr-text": "trang you always look like a whole damn snack \n"}, {"text": "#133 so excited about the recall of aaron persky, the judge who presided over the brock turner (stanford) case and gave him a lenient sentence. now, is there a way brock can get a harsher sentence? im done with this rape culture bs --\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#133 So excited about the recall of Aaron Persky, the judge who presided over the Brock Turner (Stanford) case and gave him a lenient sentence. Now, is there a way Brock can get a harsher sentence? I’m done with this rape culture BS -_-\n", "src": "mit-summer", "id": 133, "nr-text": "so excited about the recall of aaron persky, the judge who presided over the brock turner (stanford) case and gave him a lenient sentence. now, is there a way brock can get a harsher sentence? im done with this rape culture bs --\n"}, {"text": "#135 is there somewhere i can check if my classes require textbooks? stellar doesn't always allow access, so i wanted to know if there was a more streamlined way.\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#135 Is there somewhere I can check if my classes require textbooks? Stellar doesn't always allow access, so I wanted to know if there was a more streamlined way.\n", "src": "mit-summer", "id": 135, "nr-text": "is there somewhere i can check if my classes require textbooks? stellar doesn't always allow access, so i wanted to know if there was a more streamlined way.\n"}, {"text": "#130 why cuffing season gotta be in the winter when i finally got the courage to talk to you just before we broke for summer :(\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#130 Why cuffing season gotta be in the winter when I finally got the courage to talk to you just before we broke for summer :(\n", "src": "mit-summer", "id": 130, "nr-text": "why cuffing season gotta be in the winter when i finally got the courage to talk to you just before we broke for summer :(\n"}, {"text": "#127 thought a guy was great bc of his well-thought out responses in class, then i saw him leave a pub night telling a girl to \"get in the fucking car\" -- i guess u never know ppl\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#127 Thought a guy was great bc of his well-thought out responses in class, then I saw him leave a pub night telling a girl to \"get in the fucking car\" -_- I guess u never know ppl\n", "src": "mit-summer", "id": 127, "nr-text": "thought a guy was great bc of his well-thought out responses in class, then i saw him leave a pub night telling a girl to \"get in the fucking car\" -- i guess u never know ppl\n"}, {"text": "#137 which bathrooms are good to poop in\n#138 cure my boredom \n#139 how many times do people poop\n#140 how long do people poop\n#141 weirdest place you pooped\n#142 what kind of poop is most frequent\n#143 why do i poop so much after chipotle\n#144 what do you think of your poop smell\n#145 how does your poop smell\n#146 whomst is the poopiest in life\n#147 where the poop emoji at\n#148 why do us bathrooms have cracks in the door\n#149 what is your pooping method\n#150 where do you send your poop\n#151 is summer poop different from winter poop \n#152 what temperature do you poop the best in\n#153 why are you reading this while pooping\n#154 where the poop at\n#155 how old do you think your poop is\n#156 does my poop like being forced out my body with laxatives \n#157 where do you want to poop\n#158 who is the poopiest person you know\n#159 i hate dangling poops\n#160 how do assholes feel when they poop\n#161 where would you send your poop\n#162 can you poop anytime \n#163 why does my poop always come during tests\n#164 poop\n#165 who feels like poop\n#166 who feels like poopjng\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#137 Which bathrooms are good to poop in\n#138 Cure my boredom \n#139 How many times do people poop\n#140 How long do people poop\n#141 Weirdest place you pooped\n#142 What kind of poop is most frequent\n#143 Why do I poop so much after chipotle\n#144 What do you think of your poop smell\n#145 How does your poop smell\n#146 Whomst is the poopiest in life\n#147 Where the poop emoji at\n#148 Why do us bathrooms have cracks in the door\n#149 What is your pooping method\n#150 Where do you send your poop\n#151 Is summer poop different from winter poop \n#152 What temperature do you poop the best in\n#153 Why are you reading this while pooping\n#154 Where the poop at\n#155 How old do you think your poop is\n#156 Does my poop like being forced out my body with laxatives \n#157 Where do you want to poop\n#158 Who is the poopiest person you know\n#159 I hate dangling poops\n#160 How do assholes feel when they poop\n#161 Where would you send your poop\n#162 Can you poop anytime \n#163 Why does my poop always come during tests\n#164 Poop\n#165 Who feels like poop\n#166 Who feels like poopjng\n", "src": "mit-summer", "id": 137, "nr-text": "which bathrooms are good to poop in\n#138 cure my boredom \n#139 how many times do people poop\n#140 how long do people poop\n#141 weirdest place you pooped\n#142 what kind of poop is most frequent\n#143 why do i poop so much after chipotle\n#144 what do you think of your poop smell\n#145 how does your poop smell\n#146 whomst is the poopiest in life\n#147 where the poop emoji at\n#148 why do us bathrooms have cracks in the door\n#149 what is your pooping method\n#150 where do you send your poop\n#151 is summer poop different from winter poop \n#152 what temperature do you poop the best in\n#153 why are you reading this while pooping\n#154 where the poop at\n#155 how old do you think your poop is\n#156 does my poop like being forced out my body with laxatives \n#157 where do you want to poop\n#158 who is the poopiest person you know\n#159 i hate dangling poops\n#160 how do assholes feel when they poop\n#161 where would you send your poop\n#162 can you poop anytime \n#163 why does my poop always come during tests\n#164 poop\n#165 who feels like poop\n#166 who feels like poopjng\n"}, {"text": "#129 im still really sad i didnt get to see you before you moved to the other side of the country for the summer...\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#129 I’m still really sad I didn’t get to see you before you moved to the other side of the country for the summer...\n", "src": "mit-summer", "id": 129, "nr-text": "im still really sad i didnt get to see you before you moved to the other side of the country for the summer...\n"}, {"text": "#134 im kind of depressed, but one symptom ive never had is a lack of appetite. im so food motivated, i havent wanted to leave my room in the last, like, forever, but the thought of ice cream or burrito sliding down my throat literally gives me a reason to want to live. money, science, fame, intellect, drugs, sex - literally none of that motivates me as much as some of dat dank ass jp licks fruity pebbles ice cream.\ni should probably use this hidden potential to train myself, but i dont really have the discipline to. somehow, i am not that fat though, so thats cool i guess.\nalso @anyone like blah blah you unhealthy even if youre not visibly fat, like, okay bitch, at least im alive though? like sorry some days my end goal is just find a reason to want to live today, not become pinnacle of health and live forever. being that healthy sounds tiring because then id need to find more reasons to live, and apparently ice cream wouldnt even be one of them. having reasons and the drive to want to be healthy is a privilege (in some cases, even a delusion).\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#134 I’m kind of depressed, but one symptom I’ve never had is a lack of appetite. I’m so food motivated, I haven’t wanted to leave my room in the last, like, forever, but the thought of ice cream or burrito sliding down my throat literally gives me a reason to want to live. Money, science, fame, intellect, drugs, sex - literally none of that motivates me as much as some of dat dank ass JP Licks Fruity Pebbles ice cream.\nI should probably use this hidden potential to train myself, but I don’t really have the discipline to. Somehow, I am not that fat though, so that’s cool I guess.\nAlso @anyone like “blah blah you unhealthy even if you’re not visibly fat,” like, okay bitch, at least I’m alive though? Like sorry some days my end goal is just “find a reason to want to live today,” not “become pinnacle of health and live forever.” Being that healthy sounds tiring because then I’d need to find more reasons to live, and apparently ice cream wouldn’t even be one of them. Having reasons and the drive to want to be healthy is a privilege (in some cases, even a delusion).\n", "src": "mit-summer", "id": 134, "nr-text": "im kind of depressed, but one symptom ive never had is a lack of appetite. im so food motivated, i havent wanted to leave my room in the last, like, forever, but the thought of ice cream or burrito sliding down my throat literally gives me a reason to want to live. money, science, fame, intellect, drugs, sex - literally none of that motivates me as much as some of dat dank ass jp licks fruity pebbles ice cream.\ni should probably use this hidden potential to train myself, but i dont really have the discipline to. somehow, i am not that fat though, so thats cool i guess.\nalso @anyone like blah blah you unhealthy even if youre not visibly fat, like, okay bitch, at least im alive though? like sorry some days my end goal is just find a reason to want to live today, not become pinnacle of health and live forever. being that healthy sounds tiring because then id need to find more reasons to live, and apparently ice cream wouldnt even be one of them. having reasons and the drive to want to be healthy is a privilege (in some cases, even a delusion).\n"}, {"text": "#131 cats https://www.facebook.com/thecatsmitmeow\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#131 CATS https://www.facebook.com/thecatsmitmeow\n", "src": "mit-summer", "id": 131, "nr-text": "cats https://www.facebook.com/thecatsmitmeow\n"}, {"text": "#126 inf and sup, i love both of you!\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#126 Inf and Sup, I love both of you!\n", "src": "mit-summer", "id": 126, "nr-text": "inf and sup, i love both of you!\n"}, {"text": "#136 i am currently in a dilemma. i remember oh so well having a conversation about my sophomore exploratory class with my advisor and we both agreed that i would take a class in another major and consider minoring in it; so we put the class on my sophomore exploratory to enable me explore it. i did this and didn't have a good experience in the class so i decided to change to listener. i contacted the registrar and he said i did not register it on exploratory. i unfortunately do not have a screenshot of my registration from the fall but i am so sure that i double checked and was all set. what do i do? i emailed my advisor but as usual they are not responding. i know for sure that they are 100 aware of my exploration; i am just not sure of what to do now that they are not responding. please help me.\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#136 I am currently in a dilemma. I remember oh so well having a conversation about my sophomore exploratory class with my advisor and we both agreed that I would take a class in another major and consider minoring in it; so we put the class on my sophomore exploratory to enable me explore it. I did this and didn't have a good experience in the class so I decided to change to listener. I contacted the registrar and he said I did not register it on exploratory. I unfortunately do not have a screenshot of my registration from the Fall but I am so sure that I double checked and was all set. What do I do? I emailed my advisor but as usual they are not responding. I know for sure that they are 100% aware of my exploration; I am just not sure of what to do now that they are not responding. PLEASE HELP ME.\n", "src": "mit-summer", "id": 136, "nr-text": "i am currently in a dilemma. i remember oh so well having a conversation about my sophomore exploratory class with my advisor and we both agreed that i would take a class in another major and consider minoring in it; so we put the class on my sophomore exploratory to enable me explore it. i did this and didn't have a good experience in the class so i decided to change to listener. i contacted the registrar and he said i did not register it on exploratory. i unfortunately do not have a screenshot of my registration from the fall but i am so sure that i double checked and was all set. what do i do? i emailed my advisor but as usual they are not responding. i know for sure that they are 100 aware of my exploration; i am just not sure of what to do now that they are not responding. please help me.\n"}, {"text": "#128 ye isn't even the best 7-track album that kanye's produced for this month\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#128 ye isn't even the best 7-track album that Kanye's produced for this month\n", "src": "mit-summer", "id": 128, "nr-text": "ye isn't even the best 7-track album that kanye's produced for this month\n"}, {"text": "#132 currently at research, surrounded by people are further along in eecs than me by a good chunk. i feel so useless here - do i really deserve to be here?\n", "date": "06/06/2018 8:59pm", "utime": 1528343940, "orig-text": "#132 Currently at research, surrounded by people are further along in EECS than me by a good chunk. I feel so useless here - do I really deserve to be here?\n", "src": "mit-summer", "id": 132, "nr-text": "currently at research, surrounded by people are further along in eecs than me by a good chunk. i feel so useless here - do i really deserve to be here?\n"}, {"text": "#125 why no confessions at 11:59 yesterday?\n", "date": "06/05/2018 10:01pm", "utime": 1528261284, "orig-text": "#125 Why no confessions at 11:59 yesterday?\n", "src": "mit-summer", "id": 125, "nr-text": "why no confessions at 11:59 yesterday?\n"}, {"text": "#124 i've been taking half an hour shits during my 8 hours at my course 6 internship for the past week which officially means i've made more than 150 just producing crap.... if only my code worked like that lol\n", "date": "06/05/2018 10:01pm", "utime": 1528261278, "orig-text": "#124 I've been taking half an hour shits during my 8 hours at my course 6 internship for the past week which officially means I've made more than $150 just producing crap.... If only my code worked like that lol\n", "src": "mit-summer", "id": 124, "nr-text": "i've been taking half an hour shits during my 8 hours at my course 6 internship for the past week which officially means i've made more than 150 just producing crap.... if only my code worked like that lol\n"}, {"text": "#123 can there please be a cats of mit page? your cat doesnt even have to be on campus. you dont even have to be a student. just post pictures of your feline(s)\n", "date": "06/05/2018 10:01pm", "utime": 1528261273, "orig-text": "#123 Can there please be a cats of MIT page? Your cat doesn’t even have to be on campus. You don’t even have to be a student. Just post pictures of your feline(s)\n", "src": "mit-summer", "id": 123, "nr-text": "can there please be a cats of mit page? your cat doesnt even have to be on campus. you dont even have to be a student. just post pictures of your feline(s)\n"}, {"text": "#122 i was admitted as a member of the class of 2018, but due to several failures along the way, i won't be graduating this year, if at all.\ni keep on getting these emails for all of these 2018 events, and some of them sound fun, but i ultimately feel that i'd almost be cheating if i were to attend one.\n", "date": "06/05/2018 10:01pm", "utime": 1528261268, "orig-text": "#122 I was admitted as a member of the class of 2018, but due to several failures along the way, I won't be graduating this year, if at all.\nI keep on getting these emails for all of these 2018 events, and some of them sound fun, but I ultimately feel that I'd almost be cheating if I were to attend one.\n", "src": "mit-summer", "id": 122, "nr-text": "i was admitted as a member of the class of 2018, but due to several failures along the way, i won't be graduating this year, if at all.\ni keep on getting these emails for all of these 2018 events, and some of them sound fun, but i ultimately feel that i'd almost be cheating if i were to attend one.\n"}, {"text": "#121 i'm so disappointed in myself. i start off the day well, exercise, study a bit but then i stop being able to focus and i just waste the rest of the day on the internet. i keep telling myself that tomorrow is going to be a fresh start but i keep falling in the same loophole over and over again. i just hate myself for that. i'm already behind compared to other people in my major and i'm only making things worse for myself!\n", "date": "06/05/2018 10:00pm", "utime": 1528261259, "orig-text": "#121 I'm so disappointed in myself. I start off the day well, exercise, study a bit but then I stop being able to focus and I just waste the rest of the day on the internet. I keep telling myself that tomorrow is going to be a fresh start but I keep falling in the same loophole over and over again. I just hate myself for that. I'm already behind compared to other people in my major and I'm only making things worse for myself!\n", "src": "mit-summer", "id": 121, "nr-text": "i'm so disappointed in myself. i start off the day well, exercise, study a bit but then i stop being able to focus and i just waste the rest of the day on the internet. i keep telling myself that tomorrow is going to be a fresh start but i keep falling in the same loophole over and over again. i just hate myself for that. i'm already behind compared to other people in my major and i'm only making things worse for myself!\n"}, {"text": "#120 my urop supervisor essentially \"read me the riot act\" and i feel quite depressed afterwards. what should i do? my current urop is ending in 3 days and i need to churn out something.\n", "date": "06/05/2018 10:00pm", "utime": 1528261253, "orig-text": "#120 My UROP supervisor essentially \"read me the Riot Act\" and I feel quite depressed afterwards. What should I do? My current UROP is ending in 3 days and I need to churn out something.\n", "src": "mit-summer", "id": 120, "nr-text": "my urop supervisor essentially \"read me the riot act\" and i feel quite depressed afterwards. what should i do? my current urop is ending in 3 days and i need to churn out something.\n"}, {"text": "#119 mit summer confession?\nmore like bumble bee plumber jam session\n", "date": "06/05/2018 10:00pm", "utime": 1528261247, "orig-text": "#119 MIT Summer Confession?\nmore like bumble bee plumber jam session\n", "src": "mit-summer", "id": 119, "nr-text": "mit summer confession?\nmore like bumble bee plumber jam session\n"}, {"text": "#118 it's only been a week and i miss you like crazy. i used to see you all the time and now we only talk a few times a day, sometimes more, but it's the days that you're really busy that get me. cuz i'm sitting here like an hopeless idiot missing and loving you so much but feeling like i can't bother you or show it too much because i'll seem annoying. just know i miss you more than words can describe.\n", "date": "06/05/2018 10:00pm", "utime": 1528261234, "orig-text": "#118 it's only been a week and I miss you like crazy. I used to see you all the time and now we only talk a few times a day, sometimes more, but it's the days that you're really busy that get me. cuz I'm sitting here like an hopeless idiot missing and loving you so much but feeling like I can't bother you or show it too much because I'll seem annoying. just know I miss you more than words can describe.\n", "src": "mit-summer", "id": 118, "nr-text": "it's only been a week and i miss you like crazy. i used to see you all the time and now we only talk a few times a day, sometimes more, but it's the days that you're really busy that get me. cuz i'm sitting here like an hopeless idiot missing and loving you so much but feeling like i can't bother you or show it too much because i'll seem annoying. just know i miss you more than words can describe.\n"}, {"text": "#117 is there a word for \"horny but s/sex/cuddles/g\"?\n", "date": "06/05/2018 10:00pm", "utime": 1528261226, "orig-text": "#117 Is there a word for \"horny but s/sex/cuddles/g\"?\n", "src": "mit-summer", "id": 117, "nr-text": "is there a word for \"horny but s/sex/cuddles/g\"?\n"}, {"text": "#106 what's the maximum number of units you've seen someone take, and has anyone optimized specifically for this? i / my family don't have enough money to pay for tuition anymore so i have to get out of here (or switch to meng) fast.\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#106 What's the maximum number of units you've seen someone take, and has anyone optimized specifically for this? I / my family don't have enough money to pay for tuition anymore so I have to get out of here (or switch to MEng) fast.\n", "src": "mit-summer", "id": 106, "nr-text": "what's the maximum number of units you've seen someone take, and has anyone optimized specifically for this? i / my family don't have enough money to pay for tuition anymore so i have to get out of here (or switch to meng) fast.\n"}, {"text": "#115 were any couples here friends for a while before they started dating? how did that conversation go and any tips?? :\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#115 were any couples here friends for a while before they started dating? how did that conversation go and any tips?? :]\n", "src": "mit-summer", "id": 115, "nr-text": "were any couples here friends for a while before they started dating? how did that conversation go and any tips?? :\n"}, {"text": "#111 i really wish there was a mailing list like quality gays for depressed people because i have a bunch of questions i want to ask  want a community that understands, but i'm far too afraid to put my name as list owner and publicize such a thing.\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#111 I really wish there was a mailing list like quality gays for depressed people because I have a bunch of questions I want to ask & want a community that understands, but I'm far too afraid to put my name as list owner and publicize such a thing.\n", "src": "mit-summer", "id": 111, "nr-text": "i really wish there was a mailing list like quality gays for depressed people because i have a bunch of questions i want to ask  want a community that understands, but i'm far too afraid to put my name as list owner and publicize such a thing.\n"}, {"text": "#114 max, i love you!\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#114 Max, I love you!\n", "src": "mit-summer", "id": 114, "nr-text": "max, i love you!\n"}, {"text": "#109 senior week is so lit\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#109 Senior week is so lit\n", "src": "mit-summer", "id": 109, "nr-text": "senior week is so lit\n"}, {"text": "#112 i'm so lonely i wanna fucking die\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#112 I'm so lonely I wanna fucking die\n", "src": "mit-summer", "id": 112, "nr-text": "i'm so lonely i wanna fucking die\n"}, {"text": "#104 i've came to the conclusion that i'm a complete failure who has no hope on achieving anything worthwhile. does anyone have advice as to how to make my life less miserable if i won't have anything good in my life anymore?\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#104 I've came to the conclusion that I'm a complete failure who has no hope on achieving anything worthwhile. Does anyone have advice as to how to make my life less miserable if I won't have anything good in my life anymore?\n", "src": "mit-summer", "id": 104, "nr-text": "i've came to the conclusion that i'm a complete failure who has no hope on achieving anything worthwhile. does anyone have advice as to how to make my life less miserable if i won't have anything good in my life anymore?\n"}, {"text": "#116 miss my 6042 group. we slayed.\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#116 Miss my 6042 group. We slayed.\n", "src": "mit-summer", "id": 116, "nr-text": "miss my 6042 group. we slayed.\n"}, {"text": "#105 nobody cares about me, why won't people just admit that?\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#105 nobody cares about me, why won't people just admit that?\n", "src": "mit-summer", "id": 105, "nr-text": "nobody cares about me, why won't people just admit that?\n"}, {"text": "#108 is it just me or is the ua being taken over by people from ec?\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#108 Is it just me or is the UA being taken over by people from EC?\n", "src": "mit-summer", "id": 108, "nr-text": "is it just me or is the ua being taken over by people from ec?\n"}, {"text": "#110 ok, why is thinking with your dick a saying, but not thinking with your pussy a saying?\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#110 Ok, why is “thinking with your dick” a saying, but not “thinking with your pussy” a saying?\n", "src": "mit-summer", "id": 110, "nr-text": "ok, why is thinking with your dick a saying, but not thinking with your pussy a saying?\n"}, {"text": "#103 miss u bb why are you so far away\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#103 miss u bb why are you so far away\n", "src": "mit-summer", "id": 103, "nr-text": "miss u bb why are you so far away\n"}, {"text": "#107 miss u stephen!\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#107 Miss u Stephen!\n", "src": "mit-summer", "id": 107, "nr-text": "miss u stephen!\n"}, {"text": "#113 what are peoples' thoughts on the conflict between armenia and azerbaijian? who is the rightful owner of nagorno-karabekh?\n", "date": "06/04/2018 8:59pm", "utime": 1528171140, "orig-text": "#113 What are peoples' thoughts on the conflict between Armenia and Azerbaijian? Who is the rightful owner of Nagorno-Karabekh?\n", "src": "mit-summer", "id": 113, "nr-text": "what are peoples' thoughts on the conflict between armenia and azerbaijian? who is the rightful owner of nagorno-karabekh?\n"}, {"text": "#97 the friendzone doesn't exist, guys are just bad at communicating in a society that tells them to supress their feelings and not talk about them in the name of masculinity. -a guy\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#97 The friendzone doesn't exist, guys are just bad at communicating in a society that tells them to supress their feelings and not talk about them in the name of masculinity. -a guy\n", "src": "mit-summer", "id": 97, "nr-text": "the friendzone doesn't exist, guys are just bad at communicating in a society that tells them to supress their feelings and not talk about them in the name of masculinity. -a guy\n"}, {"text": "#94 i love my living group so much. you all are not who i would have expected to live with, but you're so important to me and i'm so lucky to have ended up with you. thank you for being my family and for everything <3\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#94 I love my living group so much. You all are not who I would have expected to live with, but you're so important to me and I'm so lucky to have ended up with you. Thank you for being my family and for everything <3\n", "src": "mit-summer", "id": 94, "nr-text": "i love my living group so much. you all are not who i would have expected to live with, but you're so important to me and i'm so lucky to have ended up with you. thank you for being my family and for everything <3\n"}, {"text": "#101 i am so awkward. like when someone asks me a question (someone i'm just getting to know) do i immediately ask them the question back?? like if they ask me what i like to do. i just feel like a parrot if i ask them the same question! should i expect them to answer their own question????\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#101 i am so AWKWARD. Like when someone asks me a question (someone I'm just getting to know) do I immediately ask them the question back?? Like if they ask me what I like to do. I just feel like a parrot if I ask them the same question! Should I expect them to answer their own question????\n", "src": "mit-summer", "id": 101, "nr-text": "i am so awkward. like when someone asks me a question (someone i'm just getting to know) do i immediately ask them the question back?? like if they ask me what i like to do. i just feel like a parrot if i ask them the same question! should i expect them to answer their own question????\n"}, {"text": "#96 i'm starting to suspect that all of these crush posts are the same person\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#96 I'm starting to suspect that all of these crush posts are the same person\n", "src": "mit-summer", "id": 96, "nr-text": "i'm starting to suspect that all of these crush posts are the same person\n"}, {"text": "#100 question from incoming student: is cellular wifi available from all (or most) points within the mit campus?\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#100 Question from incoming student: is cellular wifi available from all (or most) points within the MIT campus?\n", "src": "mit-summer", "id": 100, "nr-text": "question from incoming student: is cellular wifi available from all (or most) points within the mit campus?\n"}, {"text": "#93 i was actually looking forward to not seeing you for the summer, not because i wouldn't miss you, but because i hoped i'd get over you. guess not.\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#93 I was actually looking forward to not seeing you for the summer, not because I wouldn't miss you, but because I hoped I'd get over you. Guess not.\n", "src": "mit-summer", "id": 93, "nr-text": "i was actually looking forward to not seeing you for the summer, not because i wouldn't miss you, but because i hoped i'd get over you. guess not.\n"}, {"text": "#98 my boyfriend is so squishy and cuddly. i miss him already :\"(\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#98 My boyfriend is so squishy and cuddly. I miss him already :\"(\n", "src": "mit-summer", "id": 98, "nr-text": "my boyfriend is so squishy and cuddly. i miss him already :\"(\n"}, {"text": "#92 if the perpetrator is known why is no one doing anything? why does he get to just walk away after what he did? i'm looking at you mit police, dt,  (his frat)\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#92 If the perpetrator is known why is no one doing anything? Why does he get to just walk away after what he did? I'm looking at you MIT Police, DT, ** (his frat)\n", "src": "mit-summer", "id": 92, "nr-text": "if the perpetrator is known why is no one doing anything? why does he get to just walk away after what he did? i'm looking at you mit police, dt,  (his frat)\n"}, {"text": "#102 i love you, min!!!\nokay, let's be honest, i don't know anyone named min. i'm just continuing the meme.\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#102 I love you, Min!!!\nOkay, let's be honest, I don't know anyone named Min. I'm just continuing the meme.\n", "src": "mit-summer", "id": 102, "nr-text": "i love you, min!!!\nokay, let's be honest, i don't know anyone named min. i'm just continuing the meme.\n"}, {"text": "#99 sarah i miss you so much :((((((((((((((((((((((((\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#99 SARAH I MISS YOU SO MUCH :((((((((((((((((((((((((\n", "src": "mit-summer", "id": 99, "nr-text": "sarah i miss you so much :((((((((((((((((((((((((\n"}, {"text": "#95 i miss my neighbor at mit randomly screaming once a day. you take things for granted until it's gone :'(\n", "date": "06/03/2018 8:59pm", "utime": 1528084740, "orig-text": "#95 I miss my neighbor at mit randomly screaming once a day. You take things for granted until it's gone :'(\n", "src": "mit-summer", "id": 95, "nr-text": "i miss my neighbor at mit randomly screaming once a day. you take things for granted until it's gone :'(\n"}, {"text": "#87 \"tldr: children in the future (or not)\nthinking for the future, what are your opinions in having children (either same-genetics or adopting) or not having children? what is your reasoning? is it selfish to want to bring a life into this world where we know there is a lot of suffering? is it selfish to want to have a child so they can do the same or better than you? is it selfish to not give an option to this life whether they want to be born or not? where is their freedom of choice? is it nonexistent? if so, does that mean we dont have a choice in having children or not? \"\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#87 \"tldr: children in the future (or not)\nThinking for the future, what are your opinions in having children (either same-genetics or adopting) or not having children? What is your reasoning? Is it selfish to want to bring a life into this world where we know there is a lot of suffering? Is it selfish to want to have a child so they can do the same or better than you? Is it selfish to not give an option to this life whether they want to be born or not? Where is their freedom of choice? Is it nonexistent? If so, does that mean we don’t have a choice in having children or not? \"\n", "src": "mit-summer", "id": 87, "nr-text": "\"tldr: children in the future (or not)\nthinking for the future, what are your opinions in having children (either same-genetics or adopting) or not having children? what is your reasoning? is it selfish to want to bring a life into this world where we know there is a lot of suffering? is it selfish to want to have a child so they can do the same or better than you? is it selfish to not give an option to this life whether they want to be born or not? where is their freedom of choice? is it nonexistent? if so, does that mean we dont have a choice in having children or not? \"\n"}, {"text": "#84 why do i crush on people so easily? goddamn\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#84 Why do I crush on people so easily? Goddamn\n", "src": "mit-summer", "id": 84, "nr-text": "why do i crush on people so easily? goddamn\n"}, {"text": "#83 every day i lose a bit of hope that i'll ever find the same... fire, passion...with someone else that i had with you\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#83 Every day I lose a bit of hope that I'll ever find the same... fire, passion...with someone else that I had with you\n", "src": "mit-summer", "id": 83, "nr-text": "every day i lose a bit of hope that i'll ever find the same... fire, passion...with someone else that i had with you\n"}, {"text": "#88 i used to believe i'd be able to find love and the whole nine yards, but now, i'm realizing that the only way for me to get married is to have an arranged one. no one's going to marry my ass willingly, rip.\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#88 I used to believe I'd be able to find love and the whole nine yards, but now, I'm realizing that the only way for me to get married is to have an arranged one. No one's going to marry my ass willingly, rip.\n", "src": "mit-summer", "id": 88, "nr-text": "i used to believe i'd be able to find love and the whole nine yards, but now, i'm realizing that the only way for me to get married is to have an arranged one. no one's going to marry my ass willingly, rip.\n"}, {"text": "#82 when your so goes out with their ex while you're at home so you're too far away to slap them hard in the face\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#82 When your SO goes out with their ex while you're at home so you're too far away to slap them hard in the face\n", "src": "mit-summer", "id": 82, "nr-text": "when your so goes out with their ex while you're at home so you're too far away to slap them hard in the face\n"}, {"text": "#85 super heccin excited that most of my coolest friends are staying at mit this summer in my dorm and even on my own hall! i'm gonna shower all of them with love and support and murals and good home cooking and make them all move to ec next semester/stay with me forever and ever\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#85 Super heccin excited that most of my coolest friends are staying at MIT this summer in my dorm and even on my own hall! I'm gonna shower all of them with love and support and murals and good home cooking and make them all move to EC next semester/stay with me forever and ever\n", "src": "mit-summer", "id": 85, "nr-text": "super heccin excited that most of my coolest friends are staying at mit this summer in my dorm and even on my own hall! i'm gonna shower all of them with love and support and murals and good home cooking and make them all move to ec next semester/stay with me forever and ever\n"}, {"text": "#91 really upset i didn't get any institute committees :( i was really excited to do a lot for mit, plus i'm a rising junior so it's pretty much too late\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#91 really upset I didn't get any institute committees :( I was really excited to do a lot for MIT, plus I'm a rising junior so it's pretty much too late\n", "src": "mit-summer", "id": 91, "nr-text": "really upset i didn't get any institute committees :( i was really excited to do a lot for mit, plus i'm a rising junior so it's pretty much too late\n"}, {"text": "#89 the way senior week committee does skydiving is so ridiculous. just giving a list of over 100 names and telling us to independently form groups of 5 in a few hours? come on\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#89 The way senior week committee does skydiving is so ridiculous. Just giving a list of over 100 names and telling us to independently form groups of 5 in a few hours? Come on\n", "src": "mit-summer", "id": 89, "nr-text": "the way senior week committee does skydiving is so ridiculous. just giving a list of over 100 names and telling us to independently form groups of 5 in a few hours? come on\n"}, {"text": "#86 currently traveling in the same state as my crush and getting constant butterflies. i don't friggin get it though because we literally live a couple of meters from each other on a daily basis and i feel totally normal about it.\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#86 Currently traveling in the same state as my crush and getting constant butterflies. I don't friggin get it though because we literally live a couple of meters from each other on a daily basis and I feel totally normal about it.\n", "src": "mit-summer", "id": 86, "nr-text": "currently traveling in the same state as my crush and getting constant butterflies. i don't friggin get it though because we literally live a couple of meters from each other on a daily basis and i feel totally normal about it.\n"}, {"text": "#90 min, i love you.\n", "date": "06/02/2018 8:59pm", "utime": 1527998340, "orig-text": "#90 Min, I love you.\n", "src": "mit-summer", "id": 90, "nr-text": "min, i love you.\n"}, {"text": "#67 @41 francisco proskauer valerio\ni don't want a fake resume. i just want to give someone a list of places where i worked, a list of classes that i took, etc, and have them do everything else for me. i really doubt anyone would do this for free.\n", "date": "06/01/2018 8:59pm", "utime": 1527911941, "orig-text": "#67 @41 Francisco Proskauer Valerio\nI don't want a fake resume. I just want to give someone a list of places where I worked, a list of classes that I took, etc, and have them do everything else for me. I really doubt anyone would do this for free.\n", "src": "mit-summer", "id": 67, "nr-text": "@41 francisco proskauer valerio\ni don't want a fake resume. i just want to give someone a list of places where i worked, a list of classes that i took, etc, and have them do everything else for me. i really doubt anyone would do this for free.\n"}, {"text": "#68 i wouldn't be surprised if lebron left j.r.'s body in that locker room.\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#68 I wouldn't be surprised if Lebron left J.R.'s body in that locker room.\n", "src": "mit-summer", "id": 68, "nr-text": "i wouldn't be surprised if lebron left j.r.'s body in that locker room.\n"}, {"text": "#78 @57 @61 they're out of order on mit confessions too, we just don't notice because the numbers are so big. maybe it's just something with how facebook publishes scheduled posts (assuming they're scheduled, since they appear all at once)?\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#78 @57 @61 They're out of order on MIT Confessions too, we just don't notice because the numbers are so big. Maybe it's just something with how Facebook publishes scheduled posts (assuming they're scheduled, since they appear all at once)?\n", "src": "mit-summer", "id": 78, "nr-text": "@57 @61 they're out of order on mit confessions too, we just don't notice because the numbers are so big. maybe it's just something with how facebook publishes scheduled posts (assuming they're scheduled, since they appear all at once)?\n"}, {"text": "#75 mit aid is horrible. i went to a boarding school and they increased my aid package every year to match the increase in tuition/ housing/ food. i feel like they just gave me a good package last year so i decided to come here. now i am trapped. im international too so i literally cannot transfer because colleges don't offer aid to international transfers. i am trapped!!!!\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#75 MIT aid is horrible. I went to a boarding school and they increased my aid package every year to match the increase in tuition/ housing/ food. I feel like they just gave me a good package last year so I decided to come here. Now I am trapped. Im international too so I literally cannot transfer because colleges don't offer aid to international transfers. I AM TRAPPED!!!!\n", "src": "mit-summer", "id": 75, "nr-text": "mit aid is horrible. i went to a boarding school and they increased my aid package every year to match the increase in tuition/ housing/ food. i feel like they just gave me a good package last year so i decided to come here. now i am trapped. im international too so i literally cannot transfer because colleges don't offer aid to international transfers. i am trapped!!!!\n"}, {"text": "#69 quit complaining about finaid. just get a fucking loan and hate the mit corporation like the rest of us. youre getting literally the best education in the world. its not free, but youll payoff the loan easily. spoiled brats.\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#69 Quit complaining about finaid. Just get a fucking loan and hate the MIT corporation like the rest of us. You’re getting literally the best education in the world. It’s not free, but you’ll payoff the loan easily. Spoiled brats.\n", "src": "mit-summer", "id": 69, "nr-text": "quit complaining about finaid. just get a fucking loan and hate the mit corporation like the rest of us. youre getting literally the best education in the world. its not free, but youll payoff the loan easily. spoiled brats.\n"}, {"text": "#79 if you get a shitty advisor that fucking dismisses all your problems (prevent you from talking to mental, s3, getting tutoring, etc.), compares you to other people and says you shouldn't be here, says your efforts are false because test grades don't reflect that, and trys to micromanage (write down everything you do every hour-including eating, sleeping, shitting, etc.) escape! get your advisor changed, and report them. (pre-frosh don't do 20.a02-thilly.)\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#79 If you get a shitty advisor that fucking dismisses all your problems (prevent you from talking to mental, s^3, getting tutoring, etc.), compares you to other people and says you shouldn't be here, says your efforts are false because test grades don't reflect that, and trys to micromanage (write down everything you do every hour-including eating, sleeping, shitting, etc.) escape! Get your advisor changed, and report them. (Pre-frosh don't do 20.A02-Thilly.)\n", "src": "mit-summer", "id": 79, "nr-text": "if you get a shitty advisor that fucking dismisses all your problems (prevent you from talking to mental, s3, getting tutoring, etc.), compares you to other people and says you shouldn't be here, says your efforts are false because test grades don't reflect that, and trys to micromanage (write down everything you do every hour-including eating, sleeping, shitting, etc.) escape! get your advisor changed, and report them. (pre-frosh don't do 20.a02-thilly.)\n"}, {"text": "#72 what's the best way to get a fake id?\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#72 What's the best way to get a fake ID?\n", "src": "mit-summer", "id": 72, "nr-text": "what's the best way to get a fake id?\n"}, {"text": "#80 \"info (): sign up for free food and many cultural group mailing lists for free food events. cheap groceries and food in chinatown (if interested in chinese or asian food)-pool friend group together for monthly t pass (for cheaper transport). whole foods also cheap. grts have costco cards (good for buying in bulk) and there will be a shuttle bus on weekends. s3 will provide free lunch once a week. reach out to s3 if you lack money for plane tickets-they are supposed to have travel grants.\nremember to make use of mit extended insurance if you have it. make appointments early for additional immunization (some require spacing out), eye exams (1 per year), physical, etc. set up primary care physician early on and check up often-usually quality is better with them than walk-ins/urgent care to medical.\ninfo about summer (if lack of funds even with urop): s3 is supposed to have emergency funds for when summer expenses arent met. also, there should be an email about signing up for food boxes monthly over the summer.\ngeneral: tour guides dont have to follow 40 hr per week guideline-paid overtime if needed\nunfortunately, a lot of services must be seeked out and mit does bad job of telling people about the options available. \"\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#80 \"Info ($): Sign up for free food and many cultural group mailing lists for free food events. Cheap Groceries and Food in Chinatown (if interested in Chinese or Asian Food)-pool friend group together for Monthly T pass (for cheaper transport). Whole Foods also cheap. GRTs have Costco cards (good for buying in bulk) and there will be a shuttle bus on weekends. S^3 will provide free lunch once a week. Reach out to s^3 if you lack money for plane tickets-they are supposed to have travel grants.\nRemember to make use of mit extended insurance if you have it. Make appointments early for additional immunization (some require spacing out), eye exams (1 per year), physical, etc. Set up Primary Care Physician early on and check up often-usually quality is better with them than walk-ins/urgent care to medical.\nInfo about Summer (if lack of funds even with UROP): s^3 is supposed to have emergency funds for when summer expenses aren’t met. Also, there should be an email about signing up for food boxes monthly over the summer.\nGeneral: Tour Guides don’t have to follow 40 hr per week guideline-paid overtime if needed\nUnfortunately, a lot of services must be seeked out and MIT does bad job of telling people about the options available. \"\n", "src": "mit-summer", "id": 80, "nr-text": "\"info (): sign up for free food and many cultural group mailing lists for free food events. cheap groceries and food in chinatown (if interested in chinese or asian food)-pool friend group together for monthly t pass (for cheaper transport). whole foods also cheap. grts have costco cards (good for buying in bulk) and there will be a shuttle bus on weekends. s3 will provide free lunch once a week. reach out to s3 if you lack money for plane tickets-they are supposed to have travel grants.\nremember to make use of mit extended insurance if you have it. make appointments early for additional immunization (some require spacing out), eye exams (1 per year), physical, etc. set up primary care physician early on and check up often-usually quality is better with them than walk-ins/urgent care to medical.\ninfo about summer (if lack of funds even with urop): s3 is supposed to have emergency funds for when summer expenses arent met. also, there should be an email about signing up for food boxes monthly over the summer.\ngeneral: tour guides dont have to follow 40 hr per week guideline-paid overtime if needed\nunfortunately, a lot of services must be seeked out and mit does bad job of telling people about the options available. \"\n"}, {"text": "#81 don't you hate when you get attacked for something you didn't do, but you have no power to contradict the person who accused you, and now for the rest of history everyone will believe you did it?\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#81 Don't you hate when you get attacked for something you didn't do, but you have no power to contradict the person who accused you, and now for the rest of history everyone will believe you did it?\n", "src": "mit-summer", "id": 81, "nr-text": "don't you hate when you get attacked for something you didn't do, but you have no power to contradict the person who accused you, and now for the rest of history everyone will believe you did it?\n"}, {"text": "#77 i'm in shock. the nerve... the audacity\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#77 I'm in shock. The nerve... the AUDACITY\n", "src": "mit-summer", "id": 77, "nr-text": "i'm in shock. the nerve... the audacity\n"}, {"text": "#73 hijabs aren't really a symbol of islam, more of a symbol of wahhabism. there's not much in the quran about them, and they were pretty uncommon in the muslim world 50 years ago. see this nasser speech.\nhttps://www.youtube.com/watch?vtx4rk8bj2w0\nalso abdus salam was the first muslim nobel prize winner.\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#73 Hijabs aren't really a symbol of Islam, more of a symbol of Wahhabism. There's not much in the Quran about them, and they were pretty uncommon in the Muslim world ~50 years ago. See this Nasser speech.\nhttps://www.youtube.com/watch?v=TX4RK8bj2W0\nAlso Abdus Salam was the first Muslim Nobel Prize winner.\n", "src": "mit-summer", "id": 73, "nr-text": "hijabs aren't really a symbol of islam, more of a symbol of wahhabism. there's not much in the quran about them, and they were pretty uncommon in the muslim world 50 years ago. see this nasser speech.\nhttps://www.youtube.com/watch?vtx4rk8bj2w0\nalso abdus salam was the first muslim nobel prize winner.\n"}, {"text": "#76 i think idfk how to flirt anymore .. the past year i spent to get my academics together and got a 5.0 but now idk how to talk to a guy rip me\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#76 I think Idfk how to flirt anymore .. the past year I spent to get my academics together and got a 5.0 but now idk how to talk to a guy rip me\n", "src": "mit-summer", "id": 76, "nr-text": "i think idfk how to flirt anymore .. the past year i spent to get my academics together and got a 5.0 but now idk how to talk to a guy rip me\n"}, {"text": "#74 my boyfriend gives the best oral. had a celestial orgasm yesterday, i'd marry him just for that.\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#74 My boyfriend gives the best oral. Had a celestial orgasm yesterday, I'd marry him just for that.\n", "src": "mit-summer", "id": 74, "nr-text": "my boyfriend gives the best oral. had a celestial orgasm yesterday, i'd marry him just for that.\n"}, {"text": "#70 i really love you guys, my dear friends, but i do not know how much more clear i have to be without explicitly saying how i really do not want to attend your showcase/concert/w.e (and especially if they aren't free).\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#70 I really love you guys, my dear friends, but I do not know how much more clear I have to be without explicitly saying how I really do not want to attend your showcase/concert/w.e (and especially if they aren't free).\n", "src": "mit-summer", "id": 70, "nr-text": "i really love you guys, my dear friends, but i do not know how much more clear i have to be without explicitly saying how i really do not want to attend your showcase/concert/w.e (and especially if they aren't free).\n"}, {"text": "#71 two years at the 'tute already and got my brass rat, but min still has not noticed me\n", "date": "06/01/2018 8:59pm", "utime": 1527911940, "orig-text": "#71 Two years at the 'tute already and got my Brass Rat, but Min still has not noticed me\n", "src": "mit-summer", "id": 71, "nr-text": "two years at the 'tute already and got my brass rat, but min still has not noticed me\n"}, {"text": "#57 why are these confessions not in numerical order?\n", "date": "05/31/2018 8:59pm", "utime": 1527825541, "orig-text": "#57 Why are these confessions not in numerical order?\n", "src": "mit-summer", "id": 57, "nr-text": "why are these confessions not in numerical order?\n"}, {"text": "#46 @timely #7160, yup, same here. also kinda falling in love with (probably not) you. my partner is fine with this though, so, uh... hmu?\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#46 @timely #7160, yup, same here. Also kinda falling in love with (probably not) you. My partner is fine with this though, so, uh... hmu?\n", "src": "mit-summer", "id": 46, "nr-text": "@timely #7160, yup, same here. also kinda falling in love with (probably not) you. my partner is fine with this though, so, uh... hmu?\n"}, {"text": "#51 \"wtf is the difference between \"\"student contribution\"\" and \"\"mit work\"\" in my financial aid? and how the fuck is mit work a part of the \"\"award\"\"?! \nbtw does everyone get billed the same amount for student contribution (including work) or what does it depend on?\"\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#51 \"WTF is the difference between \"\"Student contribution\"\" and \"\"MIT work\"\" in my financial aid? And how the fuck is MIT work a part of the \"\"Award\"\"?! \nBTW does everyone get billed the same amount for student contribution (including work) or what does it depend on?\"\n", "src": "mit-summer", "id": 51, "nr-text": "\"wtf is the difference between \"\"student contribution\"\" and \"\"mit work\"\" in my financial aid? and how the fuck is mit work a part of the \"\"award\"\"?! \nbtw does everyone get billed the same amount for student contribution (including work) or what does it depend on?\"\n"}, {"text": "#62 daddy wornell's notes make me feel squishy\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#62 daddy wornell's notes make me feel squishy\n", "src": "mit-summer", "id": 62, "nr-text": "daddy wornell's notes make me feel squishy\n"}, {"text": "#64 to the op of #34: nope, i declined an offer in usa to do misti. i have done it before and i would do it over and over again while i have the chance. the world has much more to offer than what you're probably aware of, especially if you've never left usa. before posting something so derogatory, consider the fact that there are people who value experiences over money. if this is not you, enjoy your bubble and don't shit on misti; it's maybe the best program i've seen at mit and i'm so glad it exists.\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#64 To the OP of #34: Nope, I declined an offer in USA to do MISTI. I have done it before and I would do it over and over again while I have the chance. The world has much more to offer than what you're probably aware of, especially if you've never left USA. Before posting something so derogatory, consider the fact that there are people who value experiences over money. If this is not you, enjoy your bubble and don't shit on MISTI; it's maybe the best program I've seen at MIT and I'm so glad it exists.\n", "src": "mit-summer", "id": 64, "nr-text": "to the op of #34: nope, i declined an offer in usa to do misti. i have done it before and i would do it over and over again while i have the chance. the world has much more to offer than what you're probably aware of, especially if you've never left usa. before posting something so derogatory, consider the fact that there are people who value experiences over money. if this is not you, enjoy your bubble and don't shit on misti; it's maybe the best program i've seen at mit and i'm so glad it exists.\n"}, {"text": "#56 min, i'm missing you already\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#56 Min, I'm missing you already\n", "src": "mit-summer", "id": 56, "nr-text": "min, i'm missing you already\n"}, {"text": "#52 urop: when you fail to get a summer internship\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#52 UROP: when you fail to get a summer internship\n", "src": "mit-summer", "id": 52, "nr-text": "urop: when you fail to get a summer internship\n"}, {"text": "#54 i dislike mosquito bites.\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#54 I dislike mosquito bites.\n", "src": "mit-summer", "id": 54, "nr-text": "i dislike mosquito bites.\n"}, {"text": "#50 i still haven't gotten a financial aid package from sfs.\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#50 I still haven't gotten a financial aid package from SFS.\n", "src": "mit-summer", "id": 50, "nr-text": "i still haven't gotten a financial aid package from sfs.\n"}, {"text": "#65 every time people ask me how to get to building 20 i get really excited that i've finally met a time traveller. letters matter, people! w20 is not 20!\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#65 Every time people ask me how to get to building 20 I get really excited that I've finally met a time traveller. Letters matter, people! W20 is not 20!\n", "src": "mit-summer", "id": 65, "nr-text": "every time people ask me how to get to building 20 i get really excited that i've finally met a time traveller. letters matter, people! w20 is not 20!\n"}, {"text": "#60 i miss my best friend!!!\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#60 I MISS MY BEST FRIEND!!!\n", "src": "mit-summer", "id": 60, "nr-text": "i miss my best friend!!!\n"}, {"text": "#49 what's a boy gotta do to get black out drunk around here during summer?\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#49 What's a boy gotta do to get black out drunk around here during summer?\n", "src": "mit-summer", "id": 49, "nr-text": "what's a boy gotta do to get black out drunk around here during summer?\n"}, {"text": "#59 matt love is the hero we need but don't deserve\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#59 Matt Love is the hero we need but don't deserve\n", "src": "mit-summer", "id": 59, "nr-text": "matt love is the hero we need but don't deserve\n"}, {"text": "#53 currently in europe, only reason why i get up so early in the morning is to read confessions.\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#53 Currently in Europe, only reason why I get up so early in the morning is to read confessions.\n", "src": "mit-summer", "id": 53, "nr-text": "currently in europe, only reason why i get up so early in the morning is to read confessions.\n"}, {"text": "#48 to the people frustrated with finaid - did you know that you can talk to s3 and sfs to negotiate your finaid? especially in the cases of \"circumstances have changed and the assumptions that were made are now inaccurate\"\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#48 To the people frustrated with finaid - did you know that you can talk to S3 and SFS to negotiate your finaid? Especially in the cases of \"circumstances have changed and the assumptions that were made are now inaccurate\"\n", "src": "mit-summer", "id": 48, "nr-text": "to the people frustrated with finaid - did you know that you can talk to s3 and sfs to negotiate your finaid? especially in the cases of \"circumstances have changed and the assumptions that were made are now inaccurate\"\n"}, {"text": "#58 ok, did some research. admin: we need gif comments. this can be fixed in your page settings, i think under visitor posts.\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#58 Ok, did some research. Admin: we need gif comments. This can be fixed in your page settings, I think under visitor posts.\n", "src": "mit-summer", "id": 58, "nr-text": "ok, did some research. admin: we need gif comments. this can be fixed in your page settings, i think under visitor posts.\n"}, {"text": "#47 my best friend is graduating and moving away in 10 days. im pretty upset... i love you so much!\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#47 My best friend is graduating and moving away in 10 days. I’m pretty upset... I love you so much!\n", "src": "mit-summer", "id": 47, "nr-text": "my best friend is graduating and moving away in 10 days. im pretty upset... i love you so much!\n"}, {"text": "#63 i met with a lot of people in the past few days for support. thanks everyone you saved my sanity.\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#63 I met with a lot of people in the past few days for support. Thanks everyone you saved my sanity.\n", "src": "mit-summer", "id": 63, "nr-text": "i met with a lot of people in the past few days for support. thanks everyone you saved my sanity.\n"}, {"text": "#66 why weren't you at elf practice?\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#66 Why weren't you at Elf Practice?\n", "src": "mit-summer", "id": 66, "nr-text": "why weren't you at elf practice?\n"}, {"text": "#61 why in the world are the posts out of order?\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#61 Why in the world are the posts out of order?\n", "src": "mit-summer", "id": 61, "nr-text": "why in the world are the posts out of order?\n"}, {"text": "#55 what gives people meaning in life? i'm finding myself thinking that everything is meaningless\n", "date": "05/31/2018 8:59pm", "utime": 1527825540, "orig-text": "#55 What gives people meaning in life? I'm finding myself thinking that everything is meaningless\n", "src": "mit-summer", "id": 55, "nr-text": "what gives people meaning in life? i'm finding myself thinking that everything is meaningless\n"}, {"text": "#20 damn why everyone gotta be in silicon valley smh\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#20 Damn why everyone gotta be in Silicon Valley smh\n", "src": "mit-summer", "id": 20, "nr-text": "damn why everyone gotta be in silicon valley smh\n"}, {"text": "#19 i miss you, michelle.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#19 I miss you, Michelle.\n", "src": "mit-summer", "id": 19, "nr-text": "i miss you, michelle.\n"}, {"text": "#30 shlup shlup shlup i'm the bandyman\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#30 shlup shlup shlup i'm the bandyman\n", "src": "mit-summer", "id": 30, "nr-text": "shlup shlup shlup i'm the bandyman\n"}, {"text": "#32 i am so glad to be home so i can see my cat. she is honestly the cutest softest thing that has ever hated my guts.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#32 I am so glad to be home so I can see my cat. She is honestly the cutest softest thing that has ever hated my guts.\n", "src": "mit-summer", "id": 32, "nr-text": "i am so glad to be home so i can see my cat. she is honestly the cutest softest thing that has ever hated my guts.\n"}, {"text": "#24 i just want you to teach me topology and leave love bites on my neck.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#24 I just want you to teach me topology and leave love bites on my neck.\n", "src": "mit-summer", "id": 24, "nr-text": "i just want you to teach me topology and leave love bites on my neck.\n"}, {"text": "#15 good night, the only living boy in new york.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#15 Good night, the only living boy in New York.\n", "src": "mit-summer", "id": 15, "nr-text": "good night, the only living boy in new york.\n"}, {"text": "#25 can we avoid heavy topics here? i just come for comic relief and trying to feel better after a long day, i don't need to read 100 confessions about serious topics.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#25 Can we avoid heavy topics here? I just come for comic relief and trying to feel better after a long day, I don't need to read 100 confessions about serious topics.\n", "src": "mit-summer", "id": 25, "nr-text": "can we avoid heavy topics here? i just come for comic relief and trying to feel better after a long day, i don't need to read 100 confessions about serious topics.\n"}, {"text": "#26 with all the timely confessions about sexual assault, i'm so glad that everyone i've drunkenly gone home with has respected my wishes and refused to do anything out of my comfort zone. i can't even say how many times my sloppy wasted crossfaded-to-hell self has jumped all over someone and made out with them, only to end up in a bedroom and realize i don't really want sex and i'm only reaching out for human contact and comfort. and every time, i've woken up and somebody still has underwear on and all i remember is happy drunk cuddling. love yall, ec. you give me so much hope for humanity.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#26 With all the timely confessions about sexual assault, I'm so glad that everyone I've drunkenly gone home with has respected my wishes and refused to do anything out of my comfort zone. I can't even say how many times my sloppy wasted crossfaded-to-hell self has jumped all over someone and made out with them, only to end up in a bedroom and realize I don't really want sex and I'm only reaching out for human contact and comfort. And every time, I've woken up and somebody still has underwear on and all I remember is happy drunk cuddling. Love yall, EC. You give me so much hope for humanity.\n", "src": "mit-summer", "id": 26, "nr-text": "with all the timely confessions about sexual assault, i'm so glad that everyone i've drunkenly gone home with has respected my wishes and refused to do anything out of my comfort zone. i can't even say how many times my sloppy wasted crossfaded-to-hell self has jumped all over someone and made out with them, only to end up in a bedroom and realize i don't really want sex and i'm only reaching out for human contact and comfort. and every time, i've woken up and somebody still has underwear on and all i remember is happy drunk cuddling. love yall, ec. you give me so much hope for humanity.\n"}, {"text": "#27 why are gif comments not working here?\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#27 Why are gif comments not working here?\n", "src": "mit-summer", "id": 27, "nr-text": "why are gif comments not working here?\n"}, {"text": "#36 is it possible for a rising sophomore to pass as a frosh? i haven't turned 18 yet, haven't taken any science girs, and don't have much visible involvements. i just wanted to do my freshman year again after this mess of a year.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#36 Is it possible for a rising sophomore to pass as a frosh? I haven't turned 18 yet, haven't taken any science GIRs, and don't have much visible involvements. I just wanted to do my freshman year again after this mess of a year.\n", "src": "mit-summer", "id": 36, "nr-text": "is it possible for a rising sophomore to pass as a frosh? i haven't turned 18 yet, haven't taken any science girs, and don't have much visible involvements. i just wanted to do my freshman year again after this mess of a year.\n"}, {"text": "#28 i have a crush on abigail\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#28 I have a crush on Abigail\n", "src": "mit-summer", "id": 28, "nr-text": "i have a crush on abigail\n"}, {"text": "#43 does anyone have recommendations for moving services? i have to move my stuff into ec for summer housing, but i won't be able to until early june. i don't think i'll be able to push a giant cart from dorm row to ec. i can't drive and would like an affordable option of moving my stuff.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#43 Does anyone have recommendations for moving services? I have to move my stuff into EC for summer housing, but I won't be able to until early June. I don't think I'll be able to push a giant cart from dorm row to EC. I can't drive and would like an affordable option of moving my stuff.\n", "src": "mit-summer", "id": 43, "nr-text": "does anyone have recommendations for moving services? i have to move my stuff into ec for summer housing, but i won't be able to until early june. i don't think i'll be able to push a giant cart from dorm row to ec. i can't drive and would like an affordable option of moving my stuff.\n"}, {"text": "#35 it's funny how i'll be soon making 25 an hour but can't afford to buy mcdonalds, soda, or anything above 3 a day. thanks sfs.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#35 It's funny how I'll be soon making $25 an hour but can't afford to buy McDonalds, soda, or anything above $3 a day. Thanks SFS.\n", "src": "mit-summer", "id": 35, "nr-text": "it's funny how i'll be soon making 25 an hour but can't afford to buy mcdonalds, soda, or anything above 3 a day. thanks sfs.\n"}, {"text": "#38 i got a pretty bad fin aid award for next year... i'm a 6-2/6-3 who's only completed 111 units so far (no ap credits, international). it seems pretty difficult to early meng at this point. assuming i could ase out of 36 units, i still need to average 60 units (5 classes) to meng after junior year and 79 units (6-7 classes) to meng after my fifth semester...the latter is clearly not possible... what should i do?\ni tried cobbling up with a three-semester plan (with ases) and it just seems so depressing -- i first thought that my classes would be fun but now that i have to kinda rush my education it doesn't feel fun anymore. plus based on my track record i probably can't do this; completed 36 units in the fall and 42 in the spring. i got a lot of advice saying to try it out with 5 classes next semester first, which i'll probably do but it would be tight, and i'm just too demotivated now to do anything.\nalso my confidence in everything is shattered after what happened this year. my parents don't seem to love me anymore after they realized that i'm the complete failure i am.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#38 I got a pretty bad fin aid award for next year... I'm a 6-2/6-3 who's only completed 111 units so far (no AP credits, international). It seems pretty difficult to early MEng at this point. Assuming I could ASE out of 36 units, I still need to average 60 units (5 classes) to MEng after junior year and 79 units (6-7 classes) to MEng after my fifth semester...the latter is clearly not possible... What should I do?\nI tried cobbling up with a three-semester plan (with ASEs) and it just seems so depressing -- I first thought that my classes would be fun but now that I have to kinda rush my education it doesn't feel fun anymore. Plus based on my track record I probably can't do this; completed 36 units in the fall and 42 in the spring. I got a lot of advice saying to try it out with 5 classes next semester first, which I'll probably do but it would be tight, and I'm just too demotivated now to do anything.\nalso my confidence in everything is shattered after what happened this year. my parents don't seem to love me anymore after they realized that i'm the complete failure I am.\n", "src": "mit-summer", "id": 38, "nr-text": "i got a pretty bad fin aid award for next year... i'm a 6-2/6-3 who's only completed 111 units so far (no ap credits, international). it seems pretty difficult to early meng at this point. assuming i could ase out of 36 units, i still need to average 60 units (5 classes) to meng after junior year and 79 units (6-7 classes) to meng after my fifth semester...the latter is clearly not possible... what should i do?\ni tried cobbling up with a three-semester plan (with ases) and it just seems so depressing -- i first thought that my classes would be fun but now that i have to kinda rush my education it doesn't feel fun anymore. plus based on my track record i probably can't do this; completed 36 units in the fall and 42 in the spring. i got a lot of advice saying to try it out with 5 classes next semester first, which i'll probably do but it would be tight, and i'm just too demotivated now to do anything.\nalso my confidence in everything is shattered after what happened this year. my parents don't seem to love me anymore after they realized that i'm the complete failure i am.\n"}, {"text": "#40 does sfs reduce aid on students who worked a lot in the past year, and intend to continue working that amount? i worked a lot since my parents didn't pay the expected contribution last year, and i got an even worse package this year.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#40 Does SFS reduce aid on students who worked a lot in the past year, and intend to continue working that amount? I worked a lot since my parents didn't pay the expected contribution last year, and I got an even worse package this year.\n", "src": "mit-summer", "id": 40, "nr-text": "does sfs reduce aid on students who worked a lot in the past year, and intend to continue working that amount? i worked a lot since my parents didn't pay the expected contribution last year, and i got an even worse package this year.\n"}, {"text": "#33 people who practice polygamy always leave me very uncomfortable after talking to them. like really uncomfortable.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#33 People who practice polygamy always leave me very uncomfortable after talking to them. Like really uncomfortable.\n", "src": "mit-summer", "id": 33, "nr-text": "people who practice polygamy always leave me very uncomfortable after talking to them. like really uncomfortable.\n"}, {"text": "#13 the first guy i slept with here at mit wasn't the best experience. he didn't last very long, and i had to leave pretty quickly afterwards - or at least, it was a short time for me - because his roommate was getting antsy and annoyed at having been sexiled. this frustrated me, because athough i of course respected his roommate's wishes, cuddling is inarguably one of the best parts about those post-sex moments. but i also know that this less-than-average outcome was a result of the circumstances, and i'd honestly give him another go any day. go ahead, b, i'm all yours. <3\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#13 The first guy I slept with here at MIT wasn't the best experience. He didn't last very long, and I had to leave pretty quickly afterwards - or at least, it was a short time for me - because his roommate was getting antsy and annoyed at having been sexiled. This frustrated me, because athough I of course respected his roommate's wishes, cuddling is inarguably one of the best parts about those post-sex moments. But I also know that this less-than-average outcome was a result of the circumstances, and I'd honestly give him another go any day. Go ahead, B, I'm all yours. <3\n", "src": "mit-summer", "id": 13, "nr-text": "the first guy i slept with here at mit wasn't the best experience. he didn't last very long, and i had to leave pretty quickly afterwards - or at least, it was a short time for me - because his roommate was getting antsy and annoyed at having been sexiled. this frustrated me, because athough i of course respected his roommate's wishes, cuddling is inarguably one of the best parts about those post-sex moments. but i also know that this less-than-average outcome was a result of the circumstances, and i'd honestly give him another go any day. go ahead, b, i'm all yours. <3\n"}, {"text": "#37 i like chicken.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#37 I like chicken.\n", "src": "mit-summer", "id": 37, "nr-text": "i like chicken.\n"}, {"text": "#23 i can already tell i'm going to be bored out of my mind while at home for the summer...\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#23 I can already tell I'm going to be bored out of my mind while at home for the summer...\n", "src": "mit-summer", "id": 23, "nr-text": "i can already tell i'm going to be bored out of my mind while at home for the summer...\n"}, {"text": "#39 i like memes\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#39 i like memes\n", "src": "mit-summer", "id": 39, "nr-text": "i like memes\n"}, {"text": "#34 misti: when you fail to get a summer internship.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#34 MISTI: when you fail to get a summer internship.\n", "src": "mit-summer", "id": 34, "nr-text": "misti: when you fail to get a summer internship.\n"}, {"text": "#41 do you know anyone who can write me a good resume for ? or even better, for a  of my income from any jobs i get with that resume?\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#41 Do you know anyone who can write me a good resume for $$$? Or even better, for a % of my income from any jobs I get with that resume?\n", "src": "mit-summer", "id": 41, "nr-text": "do you know anyone who can write me a good resume for ? or even better, for a  of my income from any jobs i get with that resume?\n"}, {"text": "#16 wohe\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#16 wohe\n", "src": "mit-summer", "id": 16, "nr-text": "wohe\n"}, {"text": "#29 i realized too late that all the sigma kappa girls are cute af\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#29 I realized too late that all the sigma kappa girls are cute af\n", "src": "mit-summer", "id": 29, "nr-text": "i realized too late that all the sigma kappa girls are cute af\n"}, {"text": "#44 psa: posting about your internship you got from your parents friends just makes you look like a tool. we all know you aren't smart enough to achieve anything yourself.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#44 PSA: Posting about your internship you got from your parents friends just makes you look like a tool. We all know you aren't smart enough to achieve anything yourself.\n", "src": "mit-summer", "id": 44, "nr-text": "psa: posting about your internship you got from your parents friends just makes you look like a tool. we all know you aren't smart enough to achieve anything yourself.\n"}, {"text": "#14 yo, anyone know anyone selling girl scout cookies? i really want to buy some.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#14 Yo, anyone know anyone selling girl scout cookies? I really want to buy some.\n", "src": "mit-summer", "id": 14, "nr-text": "yo, anyone know anyone selling girl scout cookies? i really want to buy some.\n"}, {"text": "#31 are businesses allowed to just switch your start date on you? cus mine just did and i'm pissed\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#31 Are businesses allowed to just switch your start date on you? Cus mine just did and I'm pissed\n", "src": "mit-summer", "id": 31, "nr-text": "are businesses allowed to just switch your start date on you? cus mine just did and i'm pissed\n"}, {"text": "#22 just curious how many people get 5.0 at mit\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#22 just curious how many people get 5.0 at MIT\n", "src": "mit-summer", "id": 22, "nr-text": "just curious how many people get 5.0 at mit\n"}, {"text": "#18 im dependent on confession pages. halp\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#18 I’m dependent on confession pages. Halp\n", "src": "mit-summer", "id": 18, "nr-text": "im dependent on confession pages. halp\n"}, {"text": "#21 time to have no reason to talk to my crush anymore for 3 months\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#21 Time to have no reason to talk to my crush anymore for 3 months\n", "src": "mit-summer", "id": 21, "nr-text": "time to have no reason to talk to my crush anymore for 3 months\n"}, {"text": "#45 shout out to mit for not only increasing tuition and housing, but also decreasing my financial aid! i can't wait to go hungry next year!\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#45 Shout out to MIT for not only increasing tuition and housing, but also decreasing my financial aid! I can't wait to go hungry next year!\n", "src": "mit-summer", "id": 45, "nr-text": "shout out to mit for not only increasing tuition and housing, but also decreasing my financial aid! i can't wait to go hungry next year!\n"}, {"text": "#17 how many confession pages does it take to cure an mit students depression\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#17 How many confession pages does it take to cure an MIT students depression\n", "src": "mit-summer", "id": 17, "nr-text": "how many confession pages does it take to cure an mit students depression\n"}, {"text": "#42 it bothers me a lot more than im willing to admit that youre the one who started this whole mess, yet youre also the cautious one in your replies and hangout invites or lack thereof. you know, fuck you, i didnt need that headache of losing a friend and a so for something stupid that you did.\n", "date": "05/30/2018 8:59pm", "utime": 1527739140, "orig-text": "#42 It bothers me a lot more than I’m willing to admit that you’re the one who started this whole mess, yet you’re also the cautious one in your replies and hangout invites or lack thereof. You know, fuck you, I didn’t need that headache of losing a friend and a so for something stupid that you did.\n", "src": "mit-summer", "id": 42, "nr-text": "it bothers me a lot more than im willing to admit that youre the one who started this whole mess, yet youre also the cautious one in your replies and hangout invites or lack thereof. you know, fuck you, i didnt need that headache of losing a friend and a so for something stupid that you did.\n"}, {"text": "#6 now all my salt from being home can be shared with the world\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#6 Now all my salt from being home can be shared with the world\n", "src": "mit-summer", "id": 6, "nr-text": "now all my salt from being home can be shared with the world\n"}, {"text": "#10 i feel so lonely now that i'm off campus... :(\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#10 I feel so lonely now that I'm off campus... :(\n", "src": "mit-summer", "id": 10, "nr-text": "i feel so lonely now that i'm off campus... :(\n"}, {"text": "#4 i'm just here to say i was the second like on the page. clearly the first one was the creator and i wanna know who it was.\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#4 I'm just here to say I was the second like on the page. Clearly the first one was the creator and I wanna know who it was.\n", "src": "mit-summer", "id": 4, "nr-text": "i'm just here to say i was the second like on the page. clearly the first one was the creator and i wanna know who it was.\n"}, {"text": "#2 it took me 3 tries but goddammit i passed a fucking ci class\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#2 It took me 3 tries but goddammit I passed a fucking CI class\n", "src": "mit-summer", "id": 2, "nr-text": "it took me 3 tries but goddammit i passed a fucking ci class\n"}, {"text": "#5 yasssssss! thank you!\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#5 Yasssssss! Thank you!\n", "src": "mit-summer", "id": 5, "nr-text": "yasssssss! thank you!\n"}, {"text": "#9 the saga continues lmao\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#9 The saga continues lmao\n", "src": "mit-summer", "id": 9, "nr-text": "the saga continues lmao\n"}, {"text": "#8 i like gatos.\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#8 I like gatos.\n", "src": "mit-summer", "id": 8, "nr-text": "i like gatos.\n"}, {"text": "#7 the proliferation of all these confessions pages is an act of cyberterrorism.\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#7 The proliferation of all these confessions pages is an act of cyberterrorism.\n", "src": "mit-summer", "id": 7, "nr-text": "the proliferation of all these confessions pages is an act of cyberterrorism.\n"}, {"text": "#3 y'all are the hero we needed\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#3 Y'all are the hero we needed\n", "src": "mit-summer", "id": 3, "nr-text": "y'all are the hero we needed\n"}, {"text": "#1 oh no...\n", "date": "05/29/2018 9:10pm", "utime": 1527653400, "orig-text": "#1 Oh no...\n", "src": "mit-summer", "id": 1, "nr-text": "oh no...\n"}]